{"description": [
  {
    "id": "tonys",
    "description": "Tony Stark is a narcissistic billionaire industrialist and inventor who runs Stark Industries, a weapons and technology company founded by his father, Howard. In Afghanistan, Tony was attacked and captured by a terrorist group and the attack left shrapnel fragments dangerously lodged in his chest. In order to escape, he created a suit of armour powered by an arc reactor (which also prevents the shrapnel from reaching his heart.) When he returned home, he further improved the armour and became Iron Man. The armour grants him extraordinary strength, flight capability and a whole arsenal of advanced weapons."
  },
  {
    "id": "stever",
    "description": "Steve Rogers is a patriotic but scrawny kid from Brooklyn who was chosen to participate in the Super Soldier programme developed by Dr Abraham Erskine to aid the US in defeating the Nazis in World War II. Steve was the only successful test subject and became Captain America. He led his team of elite soldiers - the Howling Commandos - and defeated Red Skull and his Hydra forces. In an attempt to stop a bomb from reaching New York, Captain America sacrificed himself and crashed the plane with him still on board. Instead of perishing in the crash, Steve was frozen in ice until he was discovered and unfrozen by S.H.I.E.L.D. 70 years later."
  },
  {
    "id": "bruceb",
    "description": "Bruce Banner is a genius scientist who got exposed to a lethal dose of gamma radiation while trying to recreate the Super Soldier Serum. Instead of killing Bruce, the radiation turned him into a green monster, the Hulk, whenever his heart rate intensifies. Bruce is no longer in control of his body, and rage fuels the Hulk, making him almost invulnerable to any form of damage. Since his transformation, the US military has been trying to capture him as they think his blood is the key to creating more  Super Soldiers, but he knew better and has been on the run since. Bruce, now best friends with Tony Stark, is a part of the Avengers."
  },
  {
    "id": "thor",
    "description": "Thor is a fearsome Asgardian warrior-prince, the god of thunder and a self-proclaimed protector of Midgard (Earth). Thor wields a mythical hammer called Mjolnir but, even without it, he has godlike strength and agility. Thor used to be arrogant and spoilt, and was banished to Earth as a mortal to repent. On Earth, he met and fell in love with a human named Jane Foster, and learnt what it takes to be worthy to be a god again. Thor has to stop his adopted brother, Loki, from causing trouble throughout the Nine Realms."
  },
  {
    "id": "blackw",
    "description": "Natasha Romanoff - code name Black Widow - was a KGB agent before she joined S.H.I.E.L.D. She was first asked by then S.H.I.E.L.D. director Nick Fury to infiltrate Stark Industries to spy on Tony Stark. Natasha was to assess whether Tony was suitable for the Avengers Initiative. Although Natasha has no superpowers or fancy armour, she is an expert martial artist who can easily match up to any other members of S.H.I.E.L.D. and even the Avengers. She also has excellent computer hacking and interrogation skills."
  },
  {
    "id": "rhody",
    "description": "James Rhodes is a colonel in the United States Air Force, serving as a jet pilot and an aerospace engineer. James is Tony Stark’s best friend and is often the liaison between Stark Industries and the military in the department of acquisitions. James eventually took on the mantle of War Machine, and fought alongside Iron Man and the other Avengers. In their skirmish against Captain America regarding the Sokovia Accords, James was badly injured and required therapy in order to walk."
  },
  {
    "id": "hawke",
    "description": "Clint Barton is an agent of S.H.I.E.L.D. He is also Hawkeye, the world’s greatest marksman armed with a recurve bow. Clint was serving in the military branch of S.H.I.E.L.D. when he was deployed to guard the Mjolnir crater in New Mexico. After that, he was reassigned to guard the Tesseract at a S.H.I.E.L.D. research facility. When Loki attacked, Clint was brainwashed and was forced to attack S.H.I.E.L.D’s helicarrier. After a confrontation with Black Widow, Clint was finally able to recover from the mind-control spell and since then has been a part of the Avengers."
  },
  {
    "id": "nickf",
    "description": "Nick Fury is the former director of S.H.I.E.L.D, the world’s leading international military espionage agency. As a director, he started the Avengers Initiative as he saw that the world was facing threats much greater than humans can imagine. Nick began to recruit and assess certain gifted individuals such as Tony Stark and Bruce Banner as he operated behind the scenes, overseeing all aspects of S.H.I.E.L.D. operations all over the world. With the fall of S.H.I.E.L.D, Nick faked his own death and relocated himself to Europe, in pursuit of remaining Hydra cells."
  },
  {
    "id": "falcon",
    "description": "Sam Wilson is a former pararescuemen in the US Air Force. He was a test pilot for the EXO-7 Falcon suit developed by Stark Industries. After a close friend’s death, he left the service and became a counsellor to veterans with PTSD (post-traumatic stress disorder). Sam soon became friends with Steve Rogers and Natasha Romanoff, and assisted them when Hydra took over the Triskelion. Sam then played an important role in helping Steve locate Bucky Barnes, his childhood friend."
  },
  {
    "id": "vision",
    "description": "Vision was initially created by Ultron using the rare Wakandan metal, Vibranium, and with the help of the Mind Stone hidden inside Loki’s Sceptre. Vision was supposed to be a brand new body for him. But before Ultron could upload his consciousness into Vision, the Avengers stopped Ultron and instead uploaded Tony Stark’s AI, Jarvis, into the body. With that, Vision was born and became an Avenger, helping them put a stop to Ultron’s nefarious plan. As an Avenger, Vision seemed to have taken a liking to fellow Avenger member, Wanda Maximoff. Both of them share a special connection as their powers stem from the Mind Stone."
  },
  {
    "id": "wandam",
    "description": "Wanda Maximoff, with her twin brother, Pietro, had a hatred of Tony Stark as their parents were killed by weapons created by Stark Industries. When the opportunity presented itself, the twins took part in Wolfgang von Strucker’s experiment with Loki’s Sceptre and gained special abilities. The twins initially helped Ultron fight against the Avengers but after learning about Ultron’s end goal, switched sides and helped the Avengers defeat him. Wanda is now part of the Avengers and has a special connection with fellow Avenger Vision."
  },
  {
    "id": "pietrom",
    "description": "Pietro Maximoff, with his twin sister, Wanda, had a hatred of Tony Stark as their parents were killed by weapons created by Stark Industries. When the opportunity presented itself, the twins took part in Wolfgang von Strucker’s experiment with Loki’s Sceptre and gained special abilities. The twins initially helped Ultron fight against the Avengers but after learning about Ultron’s end goal, switched sides and helped the Avengers defeat him. In the battle of Sokovia, Pietro sacrificed himself and saved Hawkeye Clint Barton’s life by pushing him out of the way of incoming bullets."
  },
  {
    "id": "ultronu",
    "description": "Ultron is a peacekeeping artificial intelligence program created by Tony Stark. With the aid of the Mind Stone, Ultron\u0027s AI soon becomes self-aware. Its assessment of peace leads it to eventually deem the entire human race to be unfit to exist. He thinks that humans are destroying themselves and the only way to bring peace is the complete genocide of the species. Ultron starts off as a mangled Iron Legion suit, and slowly upgrades himself into Ultron Prime, and eventually resulting in his 2.4m tall robotic body, called the Ultimate Ultron. Ultron then purchased a batch of Wakandan metal, Vibranium, from blackmarket smuggler Ulysses Klaue in order to create an indestructible, new body for himself."
  },
  {
    "id": "helenc",
    "description": "Helen Cho is a renowned geneticist and a friend to Tony Stark. When Hawkeye Clint Barton was injured after a battle with Hydra, Helen was asked to help rebuild human tissue in order to aid his recovery. Ultron Prime later brainwashed Helen into using Loki’s Sceptre to help him create a new biological body using the Vibranium he acquired. When the Maximoff twins learnt the truth of Ultron’s plan, Wanda Maximoff freed Helen from Ultron’s brainwashing. The doctor turned off the process of building the body, resulting in her getting injured by Ultron in a fit of anger."
  },
  {
    "id": "ultrons",
    "description": "Ultron Sentries are a group of robots built and programmed by Ultron based on the Iron Legion suits design. After Ultron gained sentience and escaped from the Avengers Tower. He made his way to the old Hydra facility and began constructing the Ultron Sentries in order to create an army of Ultrons for him to command. Ultron’s consciousness can easily switch between the many Ultron Sentries as well, essentially making him very difficult to eliminate."
  },
  {
    "id": "mariah",
    "description": "Maria Hill is a high-ranking spy for S.H.I.E.L.D. before it fell. Then director Nick Fury\u0027s right-hand man,  Maria would take charge whenever he was unavailable. She was the first to find out that Nick faked his own death. She rescued Steve Rogers (Captain America) and Natasha Romanoff (Black Widow), and brought them to Nick. After the fall of S.H.I.E.L.D, Maria applied to work for Stark Industries, but kept her loyalties to Nick and any remaining S.H.I.E.L.D. operatives."
  },
  {
    "id": "wolfgangv",
    "description": "Wolfgang von Strucker is one of the top leaders in Hydra. Wolfgang used to be a sleeper agent planted in S.H.I.E.L.D. recruiting agents who were unhappy with the way the agency operated. After the fall of S.H.I.E.L.D. and death of another Hydra sleeper agent Alexander Pierce, Wolfgang rose up in rank and became one of the leaders of Hydra. He obtained Loki’s Sceptre from the alien attack in New York and experimented  on it, trying to harness its power. Many test subjects died due to the experiment, but a pair of twins, Pietro and Wanda Maximoff, survived the test, and gained superhuman abilities. After getting arrested by the Avengers, Wolfgang met his demise in his prison cell after an escaped Ultron killed him in order to taunt the Avengers."
  },
  {
    "id": "list",
    "description": "Dr List is a Hydra scientist that aided Hydra leader Wolfgang von Strucker in his experiments on Loki’s Scepter and using it to create genetically altered humans with abilities. Although most of the test subjects perished, only the Maximoff twins survived the experiments. When the Avengers attacked the Hydra facility, Dr List was trying to retrieve his research from the computers before he was taken out by Iron Man."
  },
  {
    "id": "peggyc",
    "description": "Peggy Carter is a British operative representing the Strategic Scientific Reserve (SSR) during World War II. Together with Colonel Chester Phillips, Peggy trained several candidates for the Super Soldier project. She met Steve Rogers and saw the potential in him to make it into the project. After Steve transformed, Peggy grew fond of him. But the pairing was not to be as Steve sacrificed himself by downing a Hydra bomber before it could reach the US. Peggy, together with inventor Howard Stark and Colonel Phillips formed S.H.I.E.L.D. after the war was won. Peggy lived her life and grew old only to be finally reunited with Steve in 2012 after he was unfrozen. Peggy passed away from old age in 2016."
  },
  {
    "id": "heimdall",
    "description": "Heimdall is an all-seeing Asgardian who stands at the Bifrost Bridge, and guards the rainbow bridge and the gates of Asgard. He is also a strong warrior, armed with a huge sword that acts as a key to activate the Bifrost. His acute extrasensory capabilities earn him the honour to be the gatekeeper of Asgard. Anyone entering or leaving Asgard has to seek permission from him. After Loki tricked Odin and took over the ruling of Asgard, Heimdall was banished from his position. Heimdall returned and helped the citizens of Asgard escape and hide from Hela’s invasion of Asgard."
  },
  {
    "id": "laurab",
    "description": "Laura Barton is the wife of Clint Barton, otherwise known as Hawkeye of the Avengers. Laura is the mother of three of Clint’s children. With the help of S.H.I.E.L.D’s Nick Fury, Laura and her children were kept secret and safe from the rest of the world, and they reside in a cabin off the grid. During their bout with Ultron in South Africa, followed by the rampage of a brainwashed Hulk, the Avengers needed a place to lay low and Clint suggested his safehouse. Laura is extremely supportive of Clint’s work with the Avengers and believes he is critical to his team."
  },
  {
    "id": "madameb",
    "description": "Madame B is one of the supervisors of the Red Room programme, a Russian initiative to train young girls to become deadly assassins. She was one of trainers that trained Black Widow Natasha Romanoff to become an assassin."
  },
  {
    "id": "ulyssesk",
    "description": "Ulysses Klaue is a despicable black market smuggler and arms dealer. He worked with a Wakandan prince called N’Jobu to steal a rare metal called Vibranium from Wakanda. Ulysses was caught and branded, and his hate for Wakanda grew. During the Vibranium sale, Ultron accidentally severed Ulysses’ arm and he had to replace it with a weaponised bionic one. Ulysses later worked with Erik Killmonger, N’Jobu’s son, in order to once again steal Vibranium, but was betrayed and killed by Erik. He used the body as a means to enter Wakanda in order to challenge the throne."
  },
  {
    "id": "pepperp",
    "description": "Virginia Potts, or Pepper as Tony Stark calls her, is the personal assistant and love interest of Tony. Due to his commitment as Iron Man and his total lack of responsibility as a leader of a company, Tony later made Pepper the new CEO of Stark Industries. As CEO of the company, Pepper rejected working together with Aldrich Killian and his company, Advanced Idea Mechanics (AIM), and she was later captured and injected with the Extremis formula. Tony tried to rescue her, but failed to catch her as she fell to what seemed like certain death. Fortunately, the Extremis formula in her body rendered her invulnerable to harm. She survived the fall and eventually aided Tony in defeating Aldrich."
  },
  {
    "id": "happyh",
    "description": "Happy Hogan is Iron Man Tony Stark’s personal chauffeur and bodyguard. He is also the head of security of Stark Industries, although he doesn’t have much martial arts experience. Happy is also one of Tony’s closest friends and confidant, one of the few people out there, besides Pepper Potts and James Rhodes, who know Tony inside out. During the business discussion between Pepper and AIM’s Aldrich Killian, Happy noticed the odd behaviour of one of Killian’s men. He followed the man, and ended up getting seriously injured in an explosion caused by unstable Extremis formula. Happy was hospitalised and soon recovered. Happy was also the person Tony put in charge of overseeing Spider-Man Peter Parker, and was the point of contact for Peter to reach Tony."
  },
  {
    "id": "howardso",
    "description": "Howard Stark is a brilliant businessman and inventor, and father of Iron Man Tony. He founded Stark Industries. During World War II, he worked with Dr Abraham Erskine on the Super Soldier formula and built the machine that injected the formula into Steve Rogers (who became Captain America). Howard created a lot of technology along the way, including the arc reactor with Anton Vanko. When his vault keeping his tech creations was broken into, Howard sought the help of British operative Peggy Carter and his butler, Edwin Jarvis, to help clear his name. Eventually, Howard, together with Peggy and Colonel Chester Phillip, founded S.H.I.E.L.D. Although Howard would always push Tony away, the fact is he really cared for him, and always believed he would be the one to change the world. Howard and his wife, Maria, were murdered by the Winter Soldier, and made it look like an accident."
  },
  {
    "id": "marias",
    "description": "Maria Stark is the wife of inventor Howard Stark and mother of Tony (Iron Man). She and her husband were run off the road by the Winter Soldier. Surviving the crash initially, Maria was strangled by the Hydra assassin."
  },
  {
    "id": "obadiahs",
    "description": "Obadiah Stane is a businessman of Stark Industries and has been running it since the death of founder Howard Stark. When Tony Stark (Iron Man) came of age, Obadiah had no choice but to pass the company on to Tony, but he remained as the firm’s second-in-command. He longed to take back Tony’s position, so Obadiah ordered a hit on Tony in Afghanistan. But instead of killing Tony, the team kidnapped him and demanded more money. Obadiah, unhappy with the change of plans, killed the terrorist group’s leader and plotted another way to dispose of Tony. He learnt of Tony’s suit of armour and devised a suit of his own called the Iron Monger. In an eventual clash against Tony, Obadiah fell to his death as he crashed into the huge arc reactor in Stark Industries building."
  },
  {
    "id": "yinsen",
    "description": "Ho Yinsen is a doctor and engineer from a small village in Afghanistan called Gulmira. His family was murdered when he was kidnapped by a secret terrorist organisation called Ten Rings, which also kidnapped Tony Stark (Iron Man). Although Yinsen met Tony years ago at an expo in Bern, Switzerland, Tony didn’t recognise him at all. Yinsen saved Tony’s life by removing shrapnel, caused by a grenade, from his chest. He implanted a makeshift electromagnet into Tony’s chest to prevent remaining shrapnel from entering his heart. When the duo tried to escape, Yinsen ran out to create a diversion and bought more time for Tony to complete his armour, while he died in the process."
  },
  {
    "id": "raza",
    "description": "Raza Hamidmi Al-Wazar is a member of a secret terrorist organisation called Ten Rings. Stationed in Afghanistan, Raza and his crew were hired by businessman Obadiah Stane to kill Tony Stark (Iron Man) during a weapons demonstration. Upon discovering the importance of their target, Raza changed the plan and forced Tony to build weapons for them. With the help of another prisoner, Ho Yinsen, Tony built the first prototype of the Iron Man armour. He escaped from captivity. Raza and his crew managed to retrieve the remains of Tony’s broken armour, and planned to work a deal with Obadiah to exchange the abandoned armour for an army of armoured soldiers. Obadiah had no intention of striking a deal, and left Raza paralysed, before killing all his crew members. It is not known if Raza survived the encounter."
  },
  {
    "id": "abub",
    "description": "Abu Bakaar is a member of a secret terrorist organisation called Ten Rings. Abu Bakaar worked under Raza Hamidmi Al-Wazar. He was one of members who kidnapped Tony Stark (who became Iron Man) in Afghanistan and forced him to build weapons for the terrorist organisation. After Tony’s escape, Abu Bakaar survived only to face Tony again, this time in his Iron Man Mark III armour in a small town called Gulmira. Tony once again spared his life, but left him to the mercy of the residents of the town."
  },
  {
    "id": "jarvis",
    "description": "Edwin Jarvis is inventor Howard Stark’s trusted British butler and ally. After Howard Stark  was accused of selling advanced weapons to the enemy, Howard sent Edwin to aid his friend, British operative Peggy Carter to help him investigate and clear his name. Edwin is a loyal butler, never once giving his employer up even under possible violent interrogation by  Strategic Scientific Reserve (SSR) agent Jack Thompson. Edwin mainly serves as a driver whenever Peggy has to go out to investigate matters, putting his driving and even piloting skills to the test. Edwin continues to serve the Stark family for many years, and eventually inspires Tony to name his artificial intelligence system, J.A.R.V.I.S."
  },
  {
    "id": "christinee",
    "description": "Christine Everhart was a journalist for Vanity Fair magazine. After interviewing Iron Man Tony Stark in Las Vegas, Christine was charmed by Tony’s wit and confidence, and ended up sleeping with him. Christine bumped in Tony again in Morocco when she was interviewing industrialist Justin Hammer about his government contract. Eventually, Christine quit Vanity Fair and joined WHiH News as a news anchor."
  },
  {
    "id": "philc",
    "description": "Phil Coulson is an espionage agent working for S.H.I.E.L.D. and is often considered a second-in-command to Nick Fury. Phil was tasked with many recruitment assignments by Nick for the Avengers Initiative such as overseeing the Mjolnir crater site in New Mexico. During the alien attack in New York, Phil was fatally wounded after Loki pierced his sceptre through his chest. His death indirectly led to the formation of the Avengers and them working together to defeat the invading aliens. Phil was then resurrected using Kree blood and continued leading his own team of remaining S.H.I.E.L.D. agents. Phil was tasked the duty to rebuild S.H.I.E.L.D as its new director."
  },
  {
    "id": "whiplash",
    "description": "Ivan Vanko is an extraordinary physicist just like his father, Anton Vanko, who used to work with Howard Stark in Stark Industries until he was deported due to selling illegal weapons. Vowing to take revenge on the Starks at his father’s deathbed, Ivan discovered his father’s old plan of the first arc reactor he built with Howard Stark, and created a replica. Ivan constructed an exoskeleton with whips as weapons, powered by the arc reactor. During the Monaco Grand Prix, Ivan took up the name Whiplash, and wreaked havoc on the tracks. Thrown into prison after getting defeated by Iron Man, Justin Hammer from Hammer Industries broke Ivan out in attempts to get him to help create suits similar to Iron Man, but Ivan had plans of his own. He made full use of Justin’s resources and built an army of drones but was defeated by Iron Man and War Machine."
  },
  {
    "id": "antonvo",
    "description": "Anton Vanko is a brilliant Soviet physicist and scientist who worked for Stark Industries. Along the way, he helped British operative Peggy Carter and Howard Stark’s trusted British butler Edwin Jarvis when they had trouble figuring out a certain chemical compound in a weapon. Anton eventually worked with Howard (founder of Stark Industries and father of Tony) on the arc reactor technology. Almost as brilliant as Howard himself but Anton lacks morals."
  },
  {
    "id": "justinh",
    "description": "Justin Hammer is a business rival of Iron Man Tony Stark, with his company Hammer Industries also manufacturing weapons for the government. After getting publicly shamed by Tony at a tribunal and losing his government contract, Justin cut a deal with physicist Ivan Vanko. Justin would rescue him from prison, and Ivan would have to build Iron Man-like suits for him. Ivan eventually double-crossed Hammer, and built an army of drones instead of what Justin wanted. Justin was arrested and incarcerated at Seagate prison."
  },
  {
    "id": "stern",
    "description": "Senator Stern is a US politician from Pennsylvania and an undercover member of Hydra. Stern tried to force Tony Stark to hand over his Iron Man technology to the US government. Clearly getting annoyed by Tony, Stern showed his unhappiness openly to Tony when he had to pin medals of bravery on Tony and James Rhodes, after their victory over Anton Vanko’s drone attack. It was only later revealed just before the fall of S.H.I.E.L.D. that Stern was in fact Hydra after a meeting with a fellow undercover agent, Jasper Sitwell."
  },
  {
    "id": "aldrichk",
    "description": "Aldrich Killian is a scientist and founder of the organisation, Advanced Idea Mechanics or AIM for short. He approached Tony Stark in his early years to propose his ideas but was promptly ignored. Deciding to work on his own, he developed the Extremis formula, an attempt to recreate the Super Soldier Serum using nanotechnology. Aldrich created a terrorist persona, The Mandarin, and hired actor, Trevor Slattery, to portray the character. He used a terrorist plot to mask his illegal experiments on the Extremis formula. Aldrich’s plan was stopped by Tony with the help of his Iron Man Legion and Pepper Potts."
  },
  {
    "id": "mayah",
    "description": "Maya Hansen is a scientist and Iron Man Tony Stark’s former lover. She joined Aldrich Killian’s company, Advanced Idea Mechanics, and worked with him to create and develop the Extremist formula. Both of them wanted Stark’s help in stabilising the formula but after Maya discovered that Aldrich was holding Tony captive, she had a change of heart. She tried to force Aldrich to release Tony by threatening to inject herself with a lethal dose of the formula but he responded by shooting her in the chest."
  },
  {
    "id": "trevors",
    "description": "Trevor Slattery is a British actor hired by Advanced Idea Mechanics founder Aldrich Killian to portray the idealised persona of an ancient terrorist known as The Mandarin. Trevor was a drug addict and a drunk, and was living on the streets when Aldrich found him, and offered him a chance to turn his life around. He was given plastic surgery to resemble the terrorist figure and posed as The Mandarin in front of the camera. In return, Aldrich promised him fame, money and women. After Iron Man Tony Stark exposed the entire operation, Trevor was sent to Seagate prison. During his time in the prison, the real Mandarin sent his men to break Trevor out of prison in order to meet him."
  },
  {
    "id": "erics",
    "description": "Eric Savin is one of the test subjects for the Extremis formula. Eric became Advanced Idea Mechanics founder Aldrich Killian’s main henchmen after the injection of the formula had a successful result. He also gained superhuman exothermic powers like being able to melt metal with his bare hands. Under The Mandarin’s orders, Eric led a strike team to destroy Tony’s mansion. Sent to kill Tony, Eric almost died when he blasted him with a repulsor ray, but Eric’s Extremis healing abilities kicked in and he healed completely. Eric captured James Rhodes and his Iron Patriot armour, and made use of his suit to hijack the plane that had US President Matthew Ellis onboard. He completed his mission by sending the president away to Aldrich in the Iron Patriot suit before Iron Man arrived and a fight ensued ending in Eric’s death."
  },
  {
    "id": "ellenb",
    "description": "Ellen Brandt is a soldier who lost her left arm due to war. She joined Advanced Idea Mechanics and volunteered to be a test subject for the Extremis formula in the hopes of regenerating her arm. She was able to regenerate her missing limb after the infusion. On top of that, she gained the super strength, speed and the ability to regenerate any part of her body. The formula also had a side effect that made her more violent and angry than before. She was sent on a mission by Aldrich to kill Iron Man Tony Stark but that led her to her demise after a gas explosion killed her instantly."
  },
  {
    "id": "jackt",
    "description": "Jack Taggart is another test subject for Advanced Idea Mechanics founder Aldrich Killian’s Extremis formula. After a meeting with fellow Extremis soldier Eric Savin was interrupted by Iron Man Tony Stark’s assistant Happy Hogan, Jack injected himself with a huge dose of the formula, causing a big explosion, killing himself in the process. The explosion also severely injured Happy."
  },
  {
    "id": "matthewe",
    "description": "Matthew Ellis is the President of the United States. President Ellis was kidnapped by Advanced Idea Mechanics founder Aldrich Killian under the guise of The Mandarin, only to be rescued by Iron Man Tony Stark and his best friend, James Rhodes. Another attempt at the president’s life was made by Hydra when they secretly took over S.H.I.E.L.D, and initiated Project Insight that targeted many individuals who pose threats to Hydra."
  },
  {
    "id": "harleyk",
    "description": "Harley Keener is a kid who became Iron Man Tony Stark’s friend after Tony broke into his garage in order to repair his broken down Iron Man Mark XLII armour, after an attack by Extremis soldier Eric Savin in his Malibu apartment. Harley assisted Tony in repairing his armour. The duo were attacked by Eric and Ellen Brandt, also an Extremis soldier, with Eric taking Harley hostage. Tony promptly dispatched Ellen and defeated Eric, saving Harley."
  },
  {
    "id": "jacksonn",
    "description": "Jackson Norriss is a member of secret terrorist organisation Ten Rings, and he disguised himself as a documentary maker. Norriss interviewed Trevor Slattery, the actor who was pretending to be The Mandarin, in his cell at Seagate. But his real mission is to get close to Trevor and break him out of prison to meet the real Mandarin."
  },
  {
    "id": "bettyr",
    "description": "Betty Ross is a cellular biologist and the only daughter of renowned US army general, Thaddeus “Thunderbolt” Ross. Betty was working with her love interest, Bruce Banner, on a gamma pulse experiment to recreate the Super Soldier formula which resulted in the accidental creation of the Hulk. The accident caused Betty to be hurt and the project was scrapped, and General Ross was determined to hunt down Bruce and take him down."
  },
  {
    "id": "thunderboltr",
    "description": "General Thaddeus “Thunderbolt” Ross is an esteemed military figure and the father of biologist Betty Ross. It was General Ross who put scientist Bruce Banner on the Super Soldier recreation project that led to the gamma accident that created The Hulk. The accident left his daughter badly hurt. Feeling guilt and rage, Thaddeus dedicated all his efforts to hunt down Bruce who was on the run. Thaddeus employed the aid of one of his best operatives, British Royal Marine Emil Blonsky, to take down Bruce in Brazil. General Ross was also in charge of the Sokovia Accords and confronted the Avengers with the proposition for them to sign the accords in order to function as a government-sanctioned team."
  },
  {
    "id": "emilb",
    "description": "Emil Blonsky is a captain in the British Royal Marines. He was dispatched on a mission in Brazil to take down fugitive, Bruce Banner. When Bruce transformed into the Hulk and destroyed Emil’s team, the beast’s immense power caught Emil’s attention. He wanted to be like the Hulk. He was later injected with what remained of the Super Soldier formula. With his abilities heightened, Emil craved yet more power. At Samuel Stern’s lab, Emil demanded Samuel transfer Bruce’s blood into his body. With that, Emil transformed into the beast, Abomination, and escaped, wrecking Harlem. He was eventually defeated by the Hulk."
  },
  {
    "id": "samuels",
    "description": "Samuel Sterns, also known as “Mr Blue”, is a cellular biologist who collaborated with Bruce Banner to find a cure for his condition. During a test, he successfully managed to revert Banner back to normal from his hulk form after injecting him with an antidote. Unknown to Banner, Samuel was actually experimenting with Bruce’s blood on animal test subjects. Emil Blonsky, a soldier sent by General Thaddeus “Thunderbolt” Ross to take down Bruce, desired to be mutated, which Samuel eagerly agreed to help with. However, after being mutated, Emil injured Samuel and destroyed his lab. Through an open wound on his forehead, Samuel was infected by Bruce’s blood, causing his cranium to mutate and expand."
  },
  {
    "id": "leonards",
    "description": "Leonard Samson is a psychotherapist in Culver University. When Bruce Banner returned to West Virginia, Leonard was dating Bruce’s ex-girlfriend, Betty Ross. Bruce’s sudden arrival made Betty’s feelings re-emerge. Feeling jealous of Bruce, Leonard informed General Thaddeus “Thunderbolt” Ross about the location of Bruce, leading to a full-on attack on Culver University by the military in their attempts to catch Bruce. The attack caused Bruce to turn into the Hulk and a rogue missile from a military helicopter almost cost Betty’s life. Leonard regretted telling the general where Bruce was."
  },
  {
    "id": "loki",
    "description": "Loki is a frost giant who was taken and raised by Odin and Frigga during the war between Asgard and Jotunheim. He became adopted brother Thor\u0027s nemesis as they competed for Odin\u0027s love and eventually the throne to Asgard. After he found out the truth about his birth and capture, Loki\u0027s hatred for his adopted father and brother grew. This hate prompted him to send The Destroyer to Earth to stop Thor from returning home. After his supposed demise, Loki returned with a magical sceptre and an alien army to destroy Earth, only to be stopped by the collective efforts of the Avengers. Back in prison in Asgard, Loki agreed to work with Thor to find Malekith, a Dark Elf who killed their mother, Frigga. After faking his own death, Loki subdued Odin, and now masquerades as Odin on the throne of Asgard. Loki had to team up once again with Thor to take down Hela, their sister, when she tried to invade Asgard."
  },
  {
    "id": "odin",
    "description": "Odin is the ruler and warrior-king of Asgard. Odin, also known as the Allfather of Asgard, is a powerful and wise leader dedicated to preserving peace in the Nine Realms of the Great Yggdrasil Tree. Odin had a son, Thor, and an adopted son, Loki, whom he treated as his own. It was eventually revealed that he had a banished daughter, Hela.  After Thor defied his orders and attacked Jotunheim, Odin banished him to Earth and laid a curse on his weapon, the hammer Mjolnir. Odin was tricked and subdued by Loki after Thor and Loki defeated Malekith. After breaking Loki’s spell, Odin remained on Earth and faded away into Valhalla after a heartfelt talk with Thor and Loki about the coming of Ragnarok and their sister, Hela."
  },
  {
    "id": "frigga",
    "description": "Frigga is the Queen of Asgard, wife of Odin the Allfather, mother of Thor and adoptive mother of Loki. She was very compassionate and nurturing to both his sons, even though Loki was adopted. Aware that Loki was always overshadowed by his brother’s strength, Frigga taught Loki the art of magic, believing it would give Loki a foundation in life. When Jane Foster is taken to Asgard in order to remove the Aether force that is absorbed into her, Frigga protected her from the invading Dark Elves and ultimately lost her life to Malekith, the leader of the Dark Elves. Her death forced the feuding brothers, Thor and Loki, to put their differences aside and work together to defeat Malekith and avenge their mother."
  },
  {
    "id": "sif",
    "description": "Sif is a female Asgardian warrior, good friend to Thor and of the Warriors Three - Fandral, Hogun and Volstagg. When Thor was banished to Earth, she and the Warriors defied Odin\u0027s order and went to Earth to take him back, fighting The Destroyer along the way. Sif had fought next to Thor in almost all his battles, including the Battle of Vanaheim. She, with Volstagg, took the Aether force to Taneleer Tivan, also known as The Collector, for safekeeping. After Loki masqueraded as Odin, Sif, on his orders, went to Earth several times to hunt down fugitives like Asgardian sorceress Lorelei and a Kree named Vin-Tak, with the help of Phil Coulson\u0027s S.H.I.E.L.D. team. Sif’s location was currently unknown when Asgard fell to demon Surtur."
  },
  {
    "id": "volstagg",
    "description": "Volstagg is a seasoned warrior and member of the Warriors Three. He was the only member of the Three to have had a family. Due to his size, Volstagg ate a lot and was a source of irritation and amusement to his comrades. During Thor and Jane\u0027s escape from Asgard, he, with Sif and the other Warriors, helped to distract the guards. Volstagg, together with his friend, Fandral, was one of the first to perish during the events of Ragnarok, when Hela invaded Asgard."
  },
  {
    "id": "hogun",
    "description": "Hogun is a Vanir, a species of humanoids native to Vanaheim, and is part of the Warriors Three. He was very serious - hardly talking or smiling - earning him the nickname \u0022Hogun the Grim\u0022. At the battle of Vanaheim, he helped Thor and fought with the Warriors Three to free the Vanirs from the Marauders. After the battle, he remained in Vanaheim to help his people in rebuilding efforts. During the events of Ragnarok, after his two friends, Volstagg and Fandral both fell at the hands of Hela, Hogun led the Asgard army and took on Hela but he eventually fell to her blades."
  },
  {
    "id": "fandral",
    "description": "Fandral, a member of the Warriors Three, is a suave and polite warrior, often fighting alongside Sif and Thor. He was extremely handsome, earning him the nickname \u0022Fandral the Dashing\u0022, and was popular with women. He used a foil in battle, and was equal parts polite and skilful in dealing with his enemies. During the Dark Elf attack on Asgard, Fandral helped Jane and Thor escape by distracting the Asgardian guards chasing them. Fandral, together with his friend, Volstagg, was one of the first to perish during the events of Ragnarok, when Hela invaded Asgard."
  },
  {
    "id": "janef",
    "description": "Jane Foster is an American astrophysicist who finds Thor in a New Mexico desert after he is banished to Earth by Odin. She and Thor eventually fell in love, despite a rocky start where she thought he was crazy. After Thor left for Asgard, Jane continued waiting for him for two years. She was reunited with Thor after accidentally falling through a space vortex to another realm where the Aether force enters her body. Jane was taken to Asgard by Thor in an attempt to save her. When that failed, she and Thor searched for Malekith to have him remove the Aether before it consumed her."
  },
  {
    "id": "eriks",
    "description": "Erik Selvig is an astrophysicist who works with Jane Foster and Darcy Lewis. He used to teach them. While doing research on the Tesseract for S.H.I.E.L.D, it opened a portal and Loki appeared. Loki brainwashed Erik and Hawkeye Clint Barton, and escaped the facility with them. Erik used the Tesseract to open a portal at the top of the Stark Tower which allowed the Chitauri army to invade under Loki’s command. After Erik broke free from the mind control, he told Black Widow Natasha Romanoff that the portal could be closed with Loki’s Sceptre. A year later, Erik was rescued by Darcy from a sanitarium in London. During the battle against Malekith at Greenwich, Erik, with Jane and Darcy, used teleportation devices they had created to help Thor defeat the Dark Elves."
  },
  {
    "id": "darcyl",
    "description": "Darcy Lewis is a political science student at Culver University, who works for astrophysicists Jane Foster and Erik Selvig as an intern. While working for them, Darcy was able to spot details that even Jane and Erik missed. When the three first encounter Thor in New Mexico, Darcy tasered him as she thought he was delusional. After Thor disappeared, she tried to help Jane to bring back Thor by creating a wormhole but failed. Two years later, Jane and Darcy were called to London by Erik but upon arrival, found that he was missing. Darcy located Erik at a local sanitarium. During the battle against Malekith at Greenwich, Darcy and Jane figured a way to use Erik’s teleportation devices to help Thor defeat the Dark Elves."
  },
  {
    "id": "laufey",
    "description": "Laufey is the king of the Frost Giants and ruler of the realm, Jotunheim. He is also the biological father of the God of Mischief, Loki. Laufey led an army of Frost Giants to a war against the Asgardians under Odin. After the final battle, Odin’s army won and he took the Frost Giant’s ultimate weapon, the Casket of Ancient Winter, from their temple. Laufey had been trying to get back this weapon from the Asgardian vault guarded by the Destroyer. When Odin went into deep “Odinsleep”, Loki took the chance to sneak Laufey and a few Frost Giants into Asgard, allowing them to kill Odin in his sleep. Loki’s true plan was later revealed when he killed Laufey and tried to use the Bifrost Bridge to destroy Jotunheim, only to be stopped by Thor."
  },
  {
    "id": "destroyer",
    "description": "The Destroyer is an emotionless entity with no consciousness that was created by Odin to stand guard in Asgardian vaults. It fires energy beams from a visor in its face, and is incredibly strong and almost invulnerable. It was sent to Earth by Loki to prevent Thor from returning to Asgard and destroyed a small town in an attempt to kill him. It was finally stopped by Thor when he regained his powers and recovered his weapon, Mjolnir. The Destroyer\u0027s remains were recovered by S.H.I.E.L.D. and an energy gun was fashioned from its body."
  },
  {
    "id": "jaspers",
    "description": "Jasper Sitwell is a undercover Hydra agent posing as a level 7 S.H.I.E.L.D. operative. He is also good friends with S.H.I.E.L.D’s Phil Coulson. After several field missions, Jasper was assigned to the helicarrier, where he found out the location of Loki. He was transferred to The Hub and worked under agent Victoria Hand. Jasper’s cover was eventually blown by Captain America Steve Rogers and Black Widow Natasha Romanoff, and they lured him to the roof and interrogated him, forcing him to reveal Hydra’s plan. Jasper was thrown out of a moving car to his apparent death by the Winter Soldier."
  },
  {
    "id": "malekith",
    "description": "Malekith the Accursed is the cruel king of the Dark Elves from Svartalfheim. He led his Dark Elf army against Asgard and wanted to use the Aether force to end the universe. Bor, Odin\u0027s father, then-ruler of Asgard, managed to stop him the first time, but Malekith escaped. When astrophysicist Jane Foster chanced upon the Aether, Malekith woke up from his slumber and attacked Asgard again to reclaim the Aether. Malekith eventually absorbed the Aether from Jane, and attempted to destroy Earth but was stopped by Thor."
  },
  {
    "id": "algrim",
    "description": "Algrim is the lieutenant in Malekith’s Dark Elves army. Serving Malekith loyally through the Asgardian war, he was one of the only surviving Dark Elves. After the Aether was absorbed into astrophysicist Jane Foster’s body, Malekith sensed the Aether and its location, Asgard. Algrim volunteered to make the ultimate sacrifice, to become the Last of the Kursed. Algrim, disguised as a Marauder prisoner, got captured and was sent into the catacombs in Asgard. In the prison, Algrim crushed the Kurse stone, turning himself into a monstrous being called Kurse. He killed Frigga before making an escape with Malekith from Asgard. Facing off again with Thor and Loki in Svartalfheim, Kurse dealt a seemingly fatal blow to Loki before he activated one of Kurse’s dark hole grenades killing Kurse."
  },
  {
    "id": "darkelf",
    "description": "The Dark Elves are one of the oldest species that ever existed. Led by their leader, Malekith, they wear masks in combat and had been waging war against their mortal enemies, the Asgardians, for ages. Driven almost to extinction by Bor, Odin’s father, a few remain under the rule of Malekith as they launched their attack on Asgard once again in search of the Aether."
  },
  {
    "id": "asgardian",
    "description": "Asgardians are a race of human-like beings that possess a highly advanced form of technology resembling magic. Led by the Odin, Asgardian soldiers wear a set of golden armour with helmets that resembles stag’s horns. During the Ragnarok event, most if not all the Asgardian soldiers led by Hogun perished under the blades of Hela, a daughter of Odin who came back to claim the throne of Asgard."
  },
  {
    "id": "bor",
    "description": "Bor is the father of Odin. He was once the king of Asgard and ruled over the Nine Realms. He is also the grandfather of Thor. In the First Battle of Svartalfheim, Bor’s Asgardian army emerged victorious against Malekith’s Dark Elves, saving the realms from eternal darkness. In order to escape, Malekith sacrificed several of his ships, dropping and crashing them into the Asgardian army, buying him and his general, Algrim, enough time to escape."
  },
  {
    "id": "hela",
    "description": "Hela is the Asgardian goddess of death, daughter of Odin and former general in Odin’s army. Hela fought alongside Odin in his conquest of the Nine Realms. She grew overly ambitious and attempted to usurp the throne, Odin banished Hela to the realm of Hel, and Hela remained there until Odin’s death. Hela returned to earth to an astonished Thor and Loki who recently just learnt of the existence of their sister. Hela returned to Asgard to claim the throne, but when the people of Asgard refused to bow to her, Hela decimated the Asgardian army and those who dared defy her. Recruiting the timid Skurge as her executioner, Hela ruled Asgard until Thor and Loki stood up against her and unleashed the fire demon, Surtur, upon Asgard. Surtur defeated Hela but destroyed Asgard in the process, bringing about Ragnarok."
  },
  {
    "id": "valk",
    "description": "Valkyrie is an Asgardian soldier, part of an elite female warriors called the Valkyries. After suffering a defeat in the hands of Hela, Valkyrie escaped with her life in shame and self-imposed an exile on the planet, Sakaar, adopting a new name, Scrapper 142. Valkyrie later found and captured Thor, and proceeded to sell him to the Grandmaster to compete in his Contest of Champions. Thor convinced Valkyrie that Asgard needed their help, and Valkyrie helped Thor and Loki to escape from Sakaar and return to Asgard to face Hela."
  },
  {
    "id": "skurge",
    "description": "Skurge is an Asgardian soldier who was placed in charge of the Bifrost Bridge by Loki, after Heimdall’s banishment. He was recruited by Hela to be her executioner in her invasion of Asgard. Eventually, he turned against Hela when he aided the people of Asgard to escape from the realm at the cost of his life, dying as a hero."
  },
  {
    "id": "korg",
    "description": "Korg is a Kronan Warrior and is one of the participants in the Grandmaster’s Contest of Champions. A kind-hearted and soft-spoken warrior, Korg made friends with Thor who was captured and forced to participate in the contest. Korg led some of the other participants in a rebellion against the Grandmaster, and helped Thor and Valkyrie escape the planet, Sakaar. At the final battle on the Bifrost Bridge, Korg and the other participants arrived to fight alongside Thor, Hulk, Valkyrie and Loki against Hela and her undead forces."
  },
  {
    "id": "miek",
    "description": "Miek is a Sakaarian insect-like warrior who is forced into competing in the Grandmaster’s Contest of Champions. Armed with a robotic body and scissors for arms, Miek is a good friend of fellow contest participant, Korg. Together with Korg, Miek escaped from Sakaar and joined Thor, Hulk, Valkyrie and Loki in their battle against Hela. During the battle, Korg accidentally stomped on Miek, and immediately assumed that he was dead. Korg carried Miek’s body around due to guilt but he eventually regained consciousness."
  },
  {
    "id": "grandm",
    "description": "The Grandmaster is a Celestial who rules over the planet, Sakaar, and holds a arena-style game called the Contest of Champions. When the Grandmaster bought Thor from Scrapper 142, he decided to pit Thor against his current champion, Hulk. In the ensuing battle, the Grandmaster was taken aback when he realised that Hulk and Thor knew each other beforehand. Thor eventually turned Hulk back into Bruce Banner before the duo escaped the Grandmaster’s clutches. Their escape also brought about a rebellion against the Grandmaster, resulting in him losing his position to the people of Sakaar."
  },
  {
    "id": "topaz",
    "description": "Topaz is a Sakaarian guard and the Grandmaster’s main bodyguard. She was ruthless and stern, and bore a grudge against Scrapper 142 for no apparent reason. After Thor, Valkyrie and Bruce Banner attempted to escape Sakaar, Topaz gave chase. When it seemed that Topaz was about to take them down, Banner accidentally triggered the fireworks on their ship, distracting Topaz and causing her to crash hers."
  },
  {
    "id": "surtur",
    "description": "Surtur is a fire demon and the ruler of Muspelheim. Surtur is said to be the one destined to initiate the Ragnarok event on Asgard, spelling doom to the entire race. Fearing this, Odin stole the source of Surtur’s power, the Eternal Flame, and banished Surtur to Muspelheim. In his search for answers about the Infinity Stones, Thor encountered a weakened Surtur in Muspelheim and defeated him. Surtur was later revived by Thor and Loki in their attempts to defeat Hela. Surtur regained his full strength with the aid of the Eternal Flame and seemingly destroyed Hela together with Asgard."
  },
  {
    "id": "fenris",
    "description": "Fenris Wolf is an Asgardian wolf who served Hela when she was the general in Odin’s army. After Hela returned to Asgard from her banishment, she revived Fenris with the Eternal Flame and the wolf resumed service under Hela. In the battle on the Bifrost Bridge, Fenris guarded the portal, preventing the people of Asgard from escaping, and soon was locked in battle with the Hulk. He eventually defeated Fenris by kicking the wolf into the vastness of space."
  },
  {
    "id": "bucky",
    "description": "Bucky Barnes is Captain America Steve Rogers\u0027 childhood friend and comrade in a special elite unit called the Howling Commandos. During a mission to infiltrate a Hydra train, Bucky fell into a frozen ravine and supposedly died. Yet he survived the fall and was found by Hydra. They brainwashed him into becoming one of Hydra’s assassins, codenamed the Winter Soldier. He was tasked to assassinate S.H.I.E.L.D. director Nick Fury, and that put him face-to-face with his former friend, Steve. He managed to disrupt some of Winter Soldier’s brainwashing. With Hydra’s downfall, the Winter Soldier ran away. Bucky resurfaced after a vengeful soldier named Helmut Zemo stole a book from a former Hydra operative that contained the Winter Soldier’s trigger words. Protecting Bucky placed Steve in the way of Tony Stark as the Iron Man found out that Bucky was responsible for the death of Tony’s parents. In the conflict, Bucky lost his mechanical arm and was hidden in Wakanda, in hopes that Shuri, sister of T’Challa, could find a way to remove Hydra’s brainwashing from Bucky completely."
  },
  {
    "id": "dumdum",
    "description": "Timothy “Dum Dum” Dugan is a non-commissioned sergeant in the US Army and part of the elite soldier team, Howling Commandos, together with Steve Rogers (Captain America) and Bucky Barnes. They play a key role in defeating Hydra and ending the war. Timothy was part of the 107th infantry regiment with Bucky that was kept imprisoned by Hydra before getting rescued by Rogers. Even after the war, Timothy continued as a member of The Howling Commandos together with British operative Peggy Carter and took down many remaining Hydra cells. Timothy also remained close friends with inventor Howard Stark."
  },
  {
    "id": "gabej",
    "description": "Gabriel “Gabe” Jones was one of the soldiers captured and imprisoned in the Hydra facility during World War II. He along with the other soldiers were single handedly rescued by Steve Rogers (Captain America) when he broke into the facility to rescue Bucky Barnes. Together with Steve, Bucky and several others, they formed an elite soldier team known as the Howling Commandos."
  },
  {
    "id": "jimm",
    "description": "James “Jim” Morita was one of the soldiers captured and imprisoned in the Hydra facility during World War II. He and other soldiers were single-handedly rescued by Steve Rogers (Captain America) when he broke into the facility to rescue Bucky Barnes. Together with Steve, Bucky and several others, they formed an elite soldier team known as the Howling Commandos. James serves as the team’s communications officer."
  },
  {
    "id": "jamesm",
    "description": "James Montgomery Falsworth was one of the soldiers captured and imprisoned in the Hydra facility during World War II. He along with the other soldiers were single-handedly rescued by  Steve Rogers (Captain America) when he broke into the facility to rescue Bucky Barnes. Together with Steve, Bucky and several others, they formed an elite soldier team known as the Howling Commandos."
  },
  {
    "id": "chesterp",
    "description": "Chester Phillips is the officer-in-command for the Strategic Scientific Reserve (SSR) which aimed to create Super Soldiers for the US army. The colonel did not believe that Steve Rogers (Captain America) was the right candidate due to his frail physique but was persuaded by Dr Abraham Erskine. After Abraham was assassinated, Chester continued to fight the war, leaving Steve behind. However, Chester later entrusted Steve with a special elite commando force, Howling Commandos, after he single-handedly rescued a platoon of men from Hydra. During a mission, Steve captured Hydra scientist Arnim Zola. Chester successfully interrogated Arnim and led an attack on the last secret Hydra base. Together with inventor Howard Stark and British operative Peggy Carter, SSR was transformed into S.H.I.E.L.D. over the years."
  },
  {
    "id": "abrahame",
    "description": "Dr Abraham Erskine is a scientist who created the Super Soldier formula. He worked under Colonel Chester Phillips in the Strategic Scientific Reserve (SSR), but before that, he was forced to work for Johann Schmidt, a Hydra officer. A failed attempt at creating the Super Soldier formula caused Johann to be deformed (and he later adapted the name, Red Skull). Abraham was the one who approved Steve Rogers\u0027 draft card despite his frail physique because he felt that Steve was the best candidate for the Super Soldier programme. Steve was transformed successfully by the formula. However, his celebration was short- lived when a Hydra assassin, disguised as a member of the state, shot Abraham in the chest, killing him. With his death, the proper formula to recreate the Super Soldier is lost."
  },
  {
    "id": "johanns",
    "description": "Johann Schmidt is an ex-SS officer and scientist who had his own branch of the Third Reich under his command - Hydra. He injected himself with an unstable version of the Super Soldier formula created by Dr Abraham Erskine. It was a failure, leaving his face bright red and deformed like a skull, hence the name - Red Skull. He led a search to find the mythical Tesseract in order to harness the cube’s cosmic power and create new weapons. In a showdown with Captain America Steve Rogers, the power core holding the Tesseract was damaged, and Johann picked up the cube with his bare hands – teleporting him to another dimension."
  },
  {
    "id": "arnimz",
    "description": "Arnim Zola is a Swiss scientist recruited by Hydra officer Johann Schmidt to help the organisation design and build advanced weapons during World War II. Arnim was captured by the allied forces in one of his missions, and his information led to the eventual defeat of Johann. Arnim was offered a position in the newly formed S.H.I.E.L.D, which he accepted, but together with other undercover agents, took the opportunity to rebuild Hydra from within S.H.I.E.L.D. Before his death, Zola programmed his consciousness to live on in a machine, continuing the eventual Hydra takeover of S.H.I.E.L.D."
  },
  {
    "id": "alexanderp",
    "description": "Alexander Pierce is Hydra’s top undercover agent, deeply infiltrated in the US government, S.H.I.E.L.D and the World Security Council. He created Project Insight to give Hydra complete control over the world under the guise of protecting it. When S.H.I.E.L.D. director Nick Fury questioned the project, Alexander sent the Winter Soldier to kill him. Alexander also secretly released many top captured Hydra officers like Daniel Whitehall. He was eventually stopped by Captain America Steve Rogers and was killed after being shot twice in the chest by Nick."
  },
  {
    "id": "brockr",
    "description": "Brock Rumlow is an undercover Hydra agent planted in S.H.I.E.L.D. Brock is also the team leader of Strike, a special operations team with Captain America Steve Rogers and Black Widow Natasha Romanoff. Rumlow was the one who took over the control room at the S.H.I.E.L.D. headquarters, The Triskelion. He had a fistfight with former pararescuemen Sam Wilson before one of the Helicarriers crashed into the building, burying Brock as it collapsed. However, he managed to survive with severe burns. He then adopted the codename Crossbones and became an independent terrorist bent on revenge against Steve and his team. After luring the Avengers to an public area, Brock fought Steve, and triggered a bomb hidden in his suit. Before it could go off, Wanda Maximoff created a barrier to contain the blast but Brock died in the explosion."
  },
  {
    "id": "jackr",
    "description": "Jack Rollins is an undercover Hydra agent planted in S.H.I.E.L.D. Rollins is also part of Captain America Steve Roger’s special operations team, Strike, together with other undercover agents such as Brock Rumlow. During Hydra’s takeover of the Triskelion, Jack was one of the agents tasked to take down Steve but failed and allowed him to escape. Jack was eventually arrested while protecting Alexander Pierce, a highly ranked Hydra officer."
  },
  {
    "id": "sharonc",
    "description": "Sharon Carter, also known by her code name Agent 13, is Captain America Steve Rogers\u0027 next-door neighbour but is actually an undercover agent for S.H.I.E.L.D, tasked by director Nick Fury to watch over Steve. She only broke her cover when Nick was shot in Steve’s apartment by an unknown assailant. During the fall of S.H.I.E.L.D, Sharon tried to stop Brock Rumlow, a Hydra mercenary, from launching the Helicarriers from the Triskelion, the headquarters of S.H.I.E.L.D, but failed. Sharon joined the CIA after the incident. She was once again involved with Steve when she was tasked to take down Bucky Barnes (Winter Soldier). She ended up helping Steve by returning his shield and providing confidential information to him."
  },
  {
    "id": "georgesb",
    "description": "Georges Batroc is an Algerian pirate and mercenary, and is one of Interpol’s most wanted fugitives. Georges is also an excellent kickboxer and martial artist, mastering a traditional French martial art called Savate. Georges hijacked a S.H.I.E.L.D. ship, the Lemurian Star, and held all its crew hostage, including an agent, Jasper Sitwell. Captain America Steve Rogers with his Strike team infiltrated the ship, freeing the hostages."
  },
  {
    "id": "tchalla",
    "description": "T’Challa is a Wakandan prince, and son of King T’Chaka and Queen Ramonda. After his father’s death at the UN bombing incident, T’Challa was certain Winter Soldier Bucky Barnes was guilty of the crime and proceeded to hunt him down. After realising that Bucky was set up, T’Challa assisted Captain America Steve Rogers in getting Bucky the help he needed to rid himself of Hydra brainwashing in Wakanda. T’Challa is now King of Wakanda. With the help of his most trusted bodyguard, Okoye, and ex-girlfriend Nakia, he went to South Korea in pursuit of arms dealer Ulysses Klaue who had stolen Vibranium material from Wakanda ages ago but always eluded capture. T’Challa’s throne was challenged when his previously unknown cousin, Erik Killmonger, remerged in Wakanda. T’Challa lost in combat to Erik and was seemingly killed when he was thrown down a waterfall. T’Challa was found and rescued by M’Baku, and returned to take his rightful place back from Erik."
  },
  {
    "id": "tchaka",
    "description": "T’Chaka is the previous king of Wakanda, father of T’Challa and husband to Queen Ramonda. As king, T’Chaka also assumed the role of Black Panther. In his reign as king, black market arms dealer and smuggler Ulysses Klaue attacked Wakanda and stole a batch of Vibranium material. T’Chaka was forced to confront his brother, N’Jobu, for assisting Ulysses in stealing the Vibranium. When N’Jobu tried to attack a young Zuri, a spy sent by T’Chaka to watch N’Jobu, T’Chaka is forced to kill his own brother, leaving a young Erik Killmonger (N’Jobu’s son) behind. T’Chaka was in Vienna at a UN event to sign the Sokovia Accords when a bomb set up by terrorist Helmut Zemo went off, killing the king."
  },
  {
    "id": "everettr",
    "description": "Everett K. Ross is a CIA operative working alongside General Thaddeus Ross and Sharon Carter. After the UN bombing incident, Everett was placed in charge of bringing in Winter Soldier Bucky Barnes and Captain America Steve Rogers for questioning. Everett was also involved with a deal with black market arms dealer Ulysses Klaue when he crossed paths with T’Challa. With T’Challa’s help, Ulysses was arrested and brought back for questioning. When Wakanda’s Erik Killmonger broke Ulysses out of the station, Everett was severely wounded. He was taken back to Wakanda for healing and helped T’Challa to regain his throne from Erik."
  },
  {
    "id": "helmutz",
    "description": "Helmut Zemo is a Sokovian military personnel who turned into a terrorist. The colonel’s family was killed in the Battle of Sokovia between the Avengers and Ultron. Knowing it\u0027s impossible to defeat the Avengers on his own, Helmut created an elaborate plan to tear the Avengers apart from the inside. Helmut captured a retired Hydra operative and stole a book containing trigger words for the Winter Soldier. He set off a bomb during a UN event, framing Winter Soldier Bucky Barnes for the deed. This event put Captain America Steve Rogers at odds with Iron Man Tony Stark as Steve tried his best to defend his friend. Helmut’s plan eventually revealed to Tony that his parents were victims to the Winter Soldier as well, further deepening the animosity between the Avenger members. Helmut tried to commit suicide when his plan succeeded but was stopped by T’Challa and placed under custody of the CIA."
  },
  {
    "id": "chitauri",
    "description": "The Chitauri are a sentient species of cybernetically enhanced aliens. They operated under a hive mind and seemed to serve under the mad titan, Thanos. After Loki’s apparent defeat after the destruction of the Bifrost Bridge, Loki was found by Thanos. He offered Loki a chance for an invasion of Earth and provided Loki with a sceptre containing the Mind Stone and an army of Chitauri foot soldiers. The invasion of New York was stopped by the formation of the Avengers."
  },
  {
    "id": "other",
    "description": "The Other is the servant of the mad titan, Thanos. He was the one who handed Loki the sceptre and command of the Chitauri forces in Loki\u0027s alien invasion of New York. He also threatened Loki with a new kind of suffering if he failed in his mission to enslave Earth. During an audience with Thanos to explain adoptive daughter Gamora\u0027s betrayal of both Ronan the Accuser and Thanos, a heated argument ensued. Ronan snapped The Other\u0027s neck with his Universal Weapon, killing him instantly."
  },
  {
    "id": "ironl",
    "description": "The Iron Legion is an army of unmanned suits created by Iron Man Tony Stark to serve as a safeguard for civilians whenever the Avengers are fighting in populated areas. These suits would fly into populated areas to protect and guard the civilians from threats and generally cordon off dangerous areas. One of the destroyed Iron Legion suit housed the first iteration of Ultron’s consciousness and attacked the Avengers with several other corrupted Iron Legion suits in the Avengers Tower."
  },
  {
    "id": "thanos",
    "description": "The villainous mad titan Thanos is the adoptive father of Gamora and Nebula. He was bent on obtaining all Infinity Stones, gems of unspeakable power, to be placed in a gauntlet that will make him almost invincible. Thanos was the master of The Other, who gave Loki the sceptre and the command of the Chitauri army in the invasion of New York. Thanos was betrayed by Ronan the Accuser when the latter decided to keep one of the Infinity Stones for himself. The mad titan decided it\u0027s time to obtain the stones for himself."
  },
  {
    "id": "peterq",
    "description": "Peter Quill is an interstellar adventurer and treasure hunter working for a group of space pirates called Ravagers. Peter was abducted from Earth at a young age right after his mother’s death and was raised by an alien named Yondu Udontu, the leader of the Ravagers. After spending 26 years of his life in space, Peter built up a reputation as a self-proclaimed legendary outlaw code-named Star-Lord, using the nickname his mother had for him. After discovering an ancient orb (which turned out to be an Infinity Stone), Peter was arrested and thrown into a space prison where he managed to escape with a bunch of similar outlaws. After their adventures together, they called themselves the Guardians Of The Galaxy, as they fought to prevent the orb from landing into the wrong hands. Peter soon discovered his father was a Celestial named Ego, and was delighted to be finally reunited with family until he uncovered the truth about his father. Together with his team, he destroyed Ego once and for all."
  },
  {
    "id": "gamora",
    "description": "Gamora is the only surviving member of her species, Zehoberei. After her family was killed by the mad titan, Thanos, Gamora was tortured and raised to be a galaxy-class killer. She soon rebelled against her adoptive father after learning of his alliance with Ronan the Accuser, to destroy the planet Xandar in return for a mystical orb which turned out to be an Infinity Stone. Tasked with finding the same orb, she crossed paths with Peter Quill, a self-proclaimed legendary outlaw named Star-Lord. Together with Rocket, Groot and Drax the Destroyer, they learnt to work together as a team and thwart Ronan\u0027s plans and save Xandar as the Guardians Of The Galaxy. At the same time, she’s trying to work out her differences with her adopted sister, Nebula."
  },
  {
    "id": "drax",
    "description": "Drax is an intergalactic criminal who has a lack of understanding for metaphors, always taking others’ words literally. Drax had a personal score to settle with Ronan the Accuser after his wife and children were slaughtered by the ruthless Kree. He attempted to kill Gamora the assassin for her links with Ronan but spared her life in the hope that Ronan would come for the woman who betrayed him. After an early encounter with Ronan, his actions resulted in Ronan obtaining the mysterious orb that turned out to be an Infinity Stone. He nearly drowned but was saved by Groot. Drax joined the Guardians Of The Galaxy, after realising they were the only friends he had ever had. When on the mission to help Star-Lord Peter Quill reunite with his father Ego, Drax developed a special relationship with Mantis, a servant of Ego."
  },
  {
    "id": "rocket",
    "description": "Used to be known only by his code name 89P13, Rocket is a genetically engineered halfworlder who is also a weapons specialist and tactician. When a bid to capture Star-Lord Peter Quill landed them all in the space prison, Kyln, Rocket devised and executed a plan to free his eventual teammates from it, having previously escaped from 22 prisons. The furry bounty hunter and mercenary was never far from his sidekick and muscle, Groot, but could hold his own in a fight, being also a pilot and technical expert. He showcased these skills when he provided the weapon Peter used against Ronan the Accuser in the final confrontation and piloting a ravager ship in the assault against Ronan\u0027s forces to save Xandar. After Groot’s sacrifice to save the group, Rocket had to take care of a baby version of Groot."
  },
  {
    "id": "groota",
    "description": "The tree-like extraterrestrial Groot is originally perceived as the hired muscle of Rocket, but proves to be a gentle soul. The giant tree often acted as Rocket’s conscience, and it seemed only Rocket could grasp what Groot was saying as everything in his native language contained only the phrase “I am Groot”. The bounty-hunting duo stumbled upon outlaw, Star-Lord Peter Quill. The ensuing scuffle with Peter and Gamora the assassin landed all four of them on the space prison, Kyln. The group escaped the prison, and together with Drax the Destroyer, go on to form the Guardians Of The Galaxy. In the final battle on Ronan the Accuser\u0027s ship, Groot gave his life to save the rest of the Guardians from plummeting to their deaths. A shard of what’s left of Groot was planted in a pot by Rocket, and soon it started to grow into a brand new Groot. Baby Groot continued to tag along with the team as they do missions, but was generally oblivious to his surrounding due to his naivety. When they were captured by Ravagers, Baby Groot helped Yondu retrieve an old head fin in order for them to escape."
  },
  {
    "id": "yonduu",
    "description": "Yondu Udontu is the leader of a band of intergalactic outlaw mercenaries called the Ravagers. He is armed with an arrow-like projectile with which he wields with the tones of his whistle. Responsible for Star-Lord Peter Quill\u0027s kidnapping, a job contracted by Peter\u0027s father, Ego, Yondu decided to keep and raise the child himself. He initially went after Peter and Gamora after Peter decided to keep an orb-like relic for himself instead of sharing the spoils with the Ravagers. Yondu was persuaded to assist Peter\u0027s team in defending Xandar against Ronan the Accuser. It was later revealed that Yondu did many kidnapping jobs for Ego and these jobs led to the him falling out with his previous Ravager’s team with Stakar Ogord, a Ravager captain. In the final battle with Ego, Yondu sacrificed himself to protect Peter as he always treated him like his own son."
  },
  {
    "id": "nebula",
    "description": "Nebula is the half-sister of Gamora the assassin and one of the adopted daughters of the mad titan, Thanos. Nebula’s arms are completely mechanical. Her weapons of choice are twin daggers which she handled deftly. An excellent combatant, both armed and unarmed, the blue-skinned cyborg was also a mean pilot and brilliant battle strategist. Nebula betrayed her father and aligned herself to Ronan the Accuser in the campaign to wipe out the planet Xandar but was defeated in a confrontation with Gamora. It was later revealed that Nebula cared a lot for Gamora and felt she only wanted to win and didn’t care about her feelings. Nebula forgave Gamora and aided the Guardians Of The Galaxy against their final battle with Ego before leaving in a spaceship to pursue a revenge mission on their father."
  },
  {
    "id": "ronan",
    "description": "Ronan the Accuser is a fanatic member of the scientifically and technologically advanced alien Kree race. Ronan refused to acknowledge the Kree Empire treaty of peace with Xandar and forged an alliance with the cosmic villain Thanos to launch a genocidal campaign to invade and wipe out the Xandarians. However, he betrayed Thanos, the adoptive father of Gamora the assassin and Nebula, when he decided to keep a mysterious orb which turns out to be an Infinity Stone, stolen from Guardians Of The Galaxy. As Xandar lay in ruins, the almost victorious Ronan was vanquished when Star-Lord Peter Quill and the rest of the Guardians use the nigh omnipotent stone against him."
  },
  {
    "id": "korath",
    "description": "An agent of the alien Kree Empire, Korath the Pursuer is a feared intergalactic hunter. An ally of Ronan the Accuser, Korath was the first to intercept Peter Quill, also known as the outlaw, Star-Lord, when he tries to steal a mysterious orb relic that Ronan was also after. They met again during the final battle on the planet Xandar where the Guardians Of The Galaxy, now led by Peter, infiltrated the Dark Aster, Ronan\u0027s flagship Kree warship. As Peter escaped his deadly grasp, Korath was finally killed by Drax in a fight, when he tore out a part of Korath’s mechanical headgear."
  },
  {
    "id": "collector",
    "description": "Taneleer Tivan aka The Collector is believed to be one of the Celestials of the Universe. He has a galactic museum of rare artifacts, oddities and species from many time periods and different worlds such as a Dark Elf, Cosmo The Spacedog and Howard The Duck. A cruel master, Taneleer enslaved his aides when they did not perform to his expectations. When Gamora the assassin delivered the orb to him with the rest of The Guardians Of The Galaxy, he revealed its possible origins and power. When Ronan\u0027s forces attacked, Tivan\u0027s aide, Carina, made a mad dash for the Infinity Stone concealed within the orb, intending to use it to free herself from him. A massive pulse of cosmic energy was unleashed, destroying most of Tivan’s precious collection."
  },
  {
    "id": "carina",
    "description": "Carina is the slave of Taneleer Tivan, or the Collector, acting as both his aide and servant. Anyone who wished to meet Tivan must first go through Carina. She didn’t like her work though, mostly due to being treated badly by Tivan. When Gamora and the other Guardians arrived in Taneleer’s lair with the mysterious orb revealed to be an Infinity Stone, Carina stood by as he explained the immense power of the Stone. When everyone wasn’t looking, Carina grabbed the Stone in the hope of using its power to free herself from Tivan, but the stone was so powerful, it disintegrated her on the spot. It created an explosion so big, it destroyed most of Tivan’s precious collection."
  },
  {
    "id": "rhomannd",
    "description": "Rhomann Dey is part of the Nova Corps, planet Xandars’ military force. He had Star-Lord Peter Quill arrested for petty theft and later again, with Gamora, Rocket Raccoon and Groot for disorderly behaviour. Later, Rhomann was contacted by Peter about Ronan the Accuser’s plan to destroy Xandar. He informed Nova Prime Irani Rael and told her that he believed Peter can be trusted. After the battle of Xandar, Rhomann was promoted to Denarian from rank of Millenian."
  },
  {
    "id": "garthans",
    "description": "Garthan Saal is part of the Nova Corps, planet Xandars’ military force. Garthan held the high rank of Denarian in the corp and led the Nova Corps Star Blaster fleet to defend Xandar from the invading Ronan the Accuser. He was killed in battle trying to stop Ronan from landing his ship."
  },
  {
    "id": "iranir",
    "description": "Irani Rael is the highest member of the Nova Corps and holds the ranking of Nova Prime. She was dedicated to protecting Xandar and keeping peace in the Galaxy. Irani demanded that the Kree Ambassador take action over the attacks on Xandarian worlds by Ronan the Accuser but was brushed aside. Later, she agreed to help Star-Lord Peter Quill and sent a fleet of Nova Corps Star Blaster for the Battle of Xandar against Ronan. After the battle was won, she was given the orb by the Guardians for safe-keeping. Irani also revealed to Peter his possible alien heritage."
  },
  {
    "id": "novac",
    "description": "The Nova Corps is an intergalactic police and military force of the Nova Empire. Their base was situated on the planet Xandar. The commander and leader of the Nova Corps was held by Irani Raei who oversaw all activities conducted by the corp."
  },
  {
    "id": "howardd",
    "description": "Howard the Duck is an anthropomorphic duck creature who used to reside in The Collector’s collection. After the explosion caused by the Power Stone contained in the orb handed over from Star-Lord Peter Quill, Howard The Duck escaped containment and was last seen on the planet Contraxia, drinking and partying with the different factions of the Ravagers."
  },
  {
    "id": "meredithq",
    "description": "Meredith Quill is a human woman who fell in love with a space man named Ego in the 1980s. Their love grew and later had a child named Peter. After Ego left the planet to restore his life force, Meredith raised Peter on her own, giving Peter the nickname of “Star-Lord”.  When Ego returned to visit Meredith, he was afraid he would grow too attached to her and couldn’t stand to leave her again in order to fulfil his mission. Ego decided to kill Meredith by implanting an incurable cancer in her head. Meredith succumbed to the cancer right in front of Peter’s eyes."
  },
  {
    "id": "kraglino",
    "description": "Kraglin Obfonteri is the right-hand man of Yondu Udontu and the first mate in his crew of Ravagers. Kraglin assisted his captain, fighting off Ronan the Accuser’s forces in the Battle of Xandar. Kraglin inadvertently started a mutiny in his Ravager’s crew claiming that Yondu was particularly protective of Star-Lord Peter Quill, allowing another Ravager named Taserfae to overthrow Yondu as the captain. Regretting his actions, Kraglin fell back to Yondu and assisted him, Rocket and Groot to escape from Taserface. After Yondu’s death in the final battle with Ego, Kraglin claimed ownership of Yondu’s head fin and whistle arrow."
  },
  {
    "id": "cosmo",
    "description": "Cosmo the Spacedog is a dog sent by the USSR space programme that somehow got lost in space and ended up in the collection of The Collector, Taneleer Tivan. After the explosion in Tivan’s collection vault caused by the Power Stone, Cosmo escaped captivity but remained in the vault. He was last seen licking Taneleer’s face trying to console the Celestial for his loss and injury."
  },
  {
    "id": "mantis",
    "description": "Mantis is a young, humanoid alien woman who was found by Ego years ago, and served as his servant on his planet. She is a powerful empath who can senses emotions with the help of her two insect-like feelers. Since she was a child, Mantis helped Ego sleep with her ability. After the Guardians Of The Galaxy arrived on Ego’s planet, Mantis became their friends, and even started to have a special relationship with Drax. Mantis decided to help her new friends by warning them about Ego’s true motives and soon allied herself with the team in their fight against Ego, becoming a new member of the Guardians Of The Galaxy."
  },
  {
    "id": "ego",
    "description": "Ego is a Celestial who is also the biological father of Star-Lord Peter Quill. A megalomaniac, Ego wanted to conquer the known universe and shape the world in his image by literally planting a seed on every conceivable planet, and allowing it to develop and turn the planet into a part of himself. He called this plan the Expansion. After landing on a planet called Earth, Ego fell in love with a human woman called Meredith and had a child with her. After forcing himself to leave, Ego hired Ravagers’ Yondu Udontu to kidnap Peter as Ego believed that it requires the power of two Celestials for the Expansion to work, and hoped that one of his many, many children would possess the Celestial gene. Instead, Yondu felt bad for Peter and kept Peter for himself. After Ego heard stories of a man from Earth who held onto an Infinity Stone without dying, he knew it was his son Peter, and he had the Celestial gene. After reuniting with Peter, Ego explained his plan to Peter but accidentally revealed that he was the cause of Peter’s mother’s death. Peter, together with the Guardians Of The Galaxy defeated Ego by blowing up his brain in the planet’s core, ending the Expansion once and for all."
  },
  {
    "id": "ayesha",
    "description": "Ayesha is the high priestess of the species called the Sovereign. She hired the Guardians Of The Galaxy to protect a batch of valuable batteries from a interdimensional beast called the Abilisk. Ayesha was brought into conflict with the team when Rocket stole a few batteries from her after completing their mission. Ayesha went on to hire the Ravagers to hunt down the Guardians Of The Galaxy. With the information given to her by a dying Taserface, Ayesha managed to track down the Guardians on Ego’s planet but still failed to apprehend them. Ayesha, angered, created what she claimed to be her greatest weapon to take on the Guardians Of The Galaxy."
  },
  {
    "id": "taserf",
    "description": "Taserface is a lieutenant in Yondu Udontu’s crew of Ravagers. After accepting a job from Ayesha to hunt down the Guardians Of The Galaxy, Taserface incited a mutiny amongst Yondu’s crew, claiming that he had grown weak and unsuitable to be the captain. Allying himself with Nebula, Taserface captured Yondu and all those who remained loyal to him and executed them systematically. Kraglin, Yondu’s first mate, went behind Taserface’s back and helped Yondu escape, wrecking the entirety of Taserface’s new crew. Before Taserface perished in the explosion on his ship, he managed to contact Ayesha with the location of the Guardians."
  },
  {
    "id": "stakaro",
    "description": "Stakar Ogord is a legendary Ravager captain. Stakar rescued Yondu Udontu in the past from slavery and made him a member of his own Ravagers crew. After finding out that Yondu accepted several child-trafficking jobs from Ego, Stakar was furious and was forced to exile Yondu from his crew as he had broken their Ravager’s code. Stakar refused to forgive Yondu even after meeting him by chance on the planet, Contraxia. He forgave Yondu only after he learnt the fact that Yondu sacrificed his own life to save Star-Lord Peter Quill from Ego. Stakar and the rest of their former Ravagers teammates attended Yondu’s funeral to honour their friend. Stakar then gathered these former teammates and discussed the possibility of reforming their old Ravagers team."
  },
  {
    "id": "martinex",
    "description": "Martinex is a Pluvian who\u0027s also the first officer in Stakar Ogord’s Ravager team. After Yondu Udontu’s exile from Stakar’s original team, most of their teammates disbanded and formed their own Ravager’s team except for Martinex, who remained a loyal first office to Stakar. Martinex and the rest of their former Ravagers teammates attended Yondu’s funeral to honour their friend. Stakar then gathered these former teammates and discussed the possibility of reforming their old Ravagers team."
  },
  {
    "id": "krugarr",
    "description": "Krugarr is a Lem sorcerer and a previous member of Stakar Ogord’s Ravager team before leaving and becoming a captain of his own Ravager team. Krugarr and the rest of their former Ravagers teammates attended Yondu Udontu’s funeral to honour their friend. Stakar then gathered these former teammates and discussed the possibility of reforming their old Ravagers team."
  },
  {
    "id": "charlie",
    "description": "Charlie-27 is a Jovian and a previous member of Stakar Ogord’s Ravager team before leaving and becoming a captain of his own Ravager team. Charlie-27 and the rest of their former Ravagers teammates attended Yondu Udontu’s funeral to honour their friend. Stakar then gathered these former teammates and discussed the possibility of reforming their old Ravagers team."
  },
  {
    "id": "aletao",
    "description": "Aleta Ogord is an Arcturian, wife to legendary Ravager captain, Stakar Ogord, and a previous member of Stakar’s Ravager team before leaving and becoming a captain of her own Ravager team. Aleta and the rest of their former Ravagers teammates attended Yondu Udontu’s funeral to honour their friend. Stakar then gathered these former teammates and discussed the possibility of reforming their old Ravagers team."
  },
  {
    "id": "mainf",
    "description": "Mainframe is an artificial intelligence and a previous member of Stakar Ogord’s Ravager team before leaving and becoming a captain of her own Ravager team. Mainframe and the rest of their former Ravagers teammates attended Yondu Udontu’s funeral to honour their friend. Stakar then gathered these former teammates and discussed the possibility of reforming their old Ravagers team."
  },
  {
    "id": "scottl",
    "description": "Scott Lang is former professional criminal who steals from rich companies and give back to the people they stole from. After getting out of prison for the Vistacorp case, Lang strives to go straight and get a proper job. His friend tried to persuade him to do one last job - steal from an old rich man. Scott refused at first but eventually caved in to the proposal as he lost his day job at Baskin Robbins. The job turned out to be test. Hank Pym wanted to recruit Scott as the next Ant-Man and to steal the Yellowjacket suit from Darren Cross, Hank’s protege who betrayed him. The stealing went smoothly until Darren donned the Yellowjacket suit and fought Scott. He managed to defeat Darren after disabling the Yellowjacket suit. Scott was later recruited by Captain America Steve Rogers to fight Iron Man Tony Stark’s team in order to help Winter Soldier Bucky Barnes stop terrorist Helmut Zemo’s plan. Scott showed off his newly acquired formula to grow into a huge Ant-Man during the airport battle."
  },
  {
    "id": "hankp",
    "description": "Henry “Hank” Pym is a physicist who used to work for S.H.I.E.L.D. He developed the Pym Particles that powered his suit, the Ant-Man suit, which could shrink and grow in size at will due to the particles. After an incident that caused Henry to lose his wife, Janet van Dyne to the Quantum Realms, he left S.H.I.E.L.D. and formed his own company, Pym Technologies. Henry took in a young protege, Darren Cross, but got betrayed when Darren tried to recreate Pym’s technology. Darren created a new suit, the Yellowjacket suit and intended to sell it to Hydra. Henry recruited Scott Lang, a former professional thief to become the new Ant-Man and try to steal the suit from Darren."
  },
  {
    "id": "hopev",
    "description": "Hope van Dyne is the daughter of physicist Hank Pym and Janet van Dyne, and a board member of the company founded by her father, Pym Technologies. After her mother’s disappearance, Hope fell out with her father. She reunited with him only after Darren Cross, the protege and new CEO of Pym Technologies betrayed Hank and tried to sell his new suit to Hydra. Hope helped Hank recruit Scott Lang, a former professional thief to steal the suit back from Darren. After Darren was defeated, Hank finally offered Hope her mother’s Wasp suit, wishing for her to assume her mantle."
  },
  {
    "id": "darrenc",
    "description": "Darren Cross is Hank Pym’s protege in Pym Technologies. He betrayed his mentor and took the company from him. He rebranded it  as “Cross Technologies”, and wanted to recreate his mentor’s Pym Particles and sell it to Hydra. He successfully created the Yellowjacket suit but was challenged by Scott Lang, the new Ant-Man. In the ensuing battle, Darren was defeated and killed."
  },
  {
    "id": "maggiel",
    "description": "Maggie Lang is the former wife of Ant-Man Scott Lang, and mother of their daughter, Cassandra. When Maggie was still married to Scott, she was supportive of his husband even though she knew of his criminal past. They got divorced after Scott landed himself in prison for stealing from his former company, Vistacorp, even though Maggie warned him against doing it. She eventually remarried."
  },
  {
    "id": "cassiel",
    "description": "Cassandra “Cassie” Lang is the daughter of Ant-Man Scott Lang and his wife, Maggie. When she was born, Scott vowed to quit his life of crime but was arrested for stealing from his former company, Vistacorp, a company who stole from their customers. Cassie’s parents divorced while Scott was serving his sentence and Maggie remarried. Cassie still loved his father, Scott, as she loved the doll he gave to her, even though it looked ugly. When the fight between Scott and Darren took place in Cassie’s house, Darren took her hostage. Scott defeated him and rescued his daughter."
  },
  {
    "id": "luis",
    "description": "Luis is a former cellmate of Ant-Man Scott Lang. After Scott was released from prison, Luis came to pick him up. He proposed a new job, which Scott at first rejected. After Scott took on the job from physicist Hank Pym to steal the Yellowjack suit from Darren Cross, Luis was part of the team that helped Scott. Luis posed as a security guard at Pym Technologies and helped Scott to sneak into the company."
  },
  {
    "id": "kurt",
    "description": "Kurt is a friend of Ant-Man Scott Lang and Luis. When physicist Hank Pym recruited Scott to be the next Ant-Man and help steal the Yellowjacket suit from Darren Cross, Scott brought along his group of buddies to help in the stealing. Kurt worked as the expert hacker in the team, helping Scott hack into the security system of Pym Technologies."
  },
  {
    "id": "dave",
    "description": "Dave is a friend of Ant-Man Scott Lang and Luis. When physicist Hank Pym recruited Scott to be the next Ant-Man and help steal the Yellowjacket suit from Darren Cross, Scott brought along his group of buddies to help in the stealing. Dave worked as the getaway driver in the team, always ready to make a quick getaway for the team in case anything goes wrong."
  },
  {
    "id": "stephens",
    "description": "Stephen Vincent Strange is a world-renowned neurosurgeon. Brilliant but arrogant, Stephen or Dr Strange cared only about himself. After getting into a severe car accident, Stephen damaged the nerve endings of his fingers which resulted in his hands being practically crippled. After his futile search for a cure in Western medicine, Stephen turned to the Mystic Arts for healing. Told to go to a place called Kamar-Taj in Nepal, he journeyed to the Far East and found the Ancient One. Stephen trained under the Ancient One and Karl Mordo to slowly regain the use of his hands, while also helping his masters fend off an imminent threat of Kaecilius, a former student of the Ancient One who went rogue and tried to merge Earth with the Dark Dimension. After witnessing the death of the Ancient One, Stephen became the new protector of the New York Sanctum, facing off Kaecilius and Dormammu, the ruler of the Dark Dimension with the help of the Eye of Agamotto, which contained the Time Stone. Stephen later helped Thor locate Odin after Loki banished their father to Earth."
  },
  {
    "id": "karlm",
    "description": "Karl Mordo is a former member of the Masters of the Mystic Arts. One of the Ancient One’s best students, Karl helped train the new recruits including Stephen Strange or Dr Strange. During a battle with Kaecilius and his zealots, Karl discovered the truth that the Ancient One had been drawing her powers from the Dark Dimension, which was a forbidden act. This changed Karl’s perspective on the whole situation and felt betrayed by his master. After the death of the Ancient One and the defeat of Dormammu, Karl left his allies at the Masters of the Mystic Arts and went around stripping any magic users of their powers in order to restore balance."
  },
  {
    "id": "anciento",
    "description": "The Ancient One is the leader of a group called the Masters of the Mystic Arts and also the Sorcerer Supreme. She had protected Earth from all kinds of mystical threats for centuries and aided many by teaching the magical arts to those who needed hope. A former student of hers, Kaecilius went rogue and stole a mystical text that allows him to merge Earth with the Dark Dimension. The Ancient One tries to stop him but Kaecilius escaped. Although the Ancient One was reluctant to train Stephen Strange or Dr Strange at first, her student, Karl Mordo, convinced her otherwise. Kaecilius soon revealed the truth to everyone that the Ancient One herself had been drawing her powers from the Dark Dimension but she argued that it was done for the good of others. In a final battle with Kaecilius, the Ancient One succumbed to her injuries and died, passing on the mantle of Sorcerer Supreme to Stephen."
  },
  {
    "id": "kaecilius",
    "description": "Kaecilius is a powerful sorcerer and a former member of the Masters of the Mystic Arts. He couldn’t understand why his mentor, the Ancient One, refused to allow anyone to tamper with other dimensions although she herself was drawing energy from the Dark Dimension. Kaecilius went rogue and formed the Zealots with the intention to defeat his mentor and unite Earth with the Dark Dimension. Although Kaecilius was successful in killing his mentor, he was challenged by Stephen Strange or Dr Strange who, with the help of the Eye of Agamotto defeated Kaecilius. Kaecilius and his Zealots were absorbed into the Dark Dimension by Dormammu."
  },
  {
    "id": "christinep",
    "description": "Christine Palmer is a surgeon, and a former colleague and girlfriend of Stephen Strange. They broke up due to his egoistic personality, and remained friends and co-workers. After Stephen (Dr Strange) crippled his hand in the car accident, Christine helped him through the ordeal, seeking aid from other doctors. As Stephen’s patience grew thin, he lashed out at Christine and she left him. After a fierce battle with Kaecilius, Strange returned injured to Christine through a portal, and she operated on him, saving his life. Christine later operated on the Ancient One as well, but failed to save her."
  },
  {
    "id": "wong",
    "description": "Wong is a Master of the Mystic Arts, and also the librarian of Kamar-Taj. When the previous librarian was murdered by Kaecilius when he was obtaining the ancient text, Wong had to step in and take the place of the librarian. Wong assisted Stephen Strange in his studies although he\u0027s strict on the usage of the ancient books in the library. When Kaecilius attacked the Hong Kong Sanctum, Wong and some other fellow masters were there to defend the place but they were swiftly defeated. Stephen or Dr Strange made use of the Eye of Agamotto and the Time Stone within to turn back time in order to save Wong’s life."
  },
  {
    "id": "jonathanp",
    "description": "Jonathan Pangborn is a factory worker. Both his legs were paralysed after an accident at the workplace. He sought healing at the Kamar-Taj and returned home with his legs restored. When Stephen Strange couldn’t get any help from Western medicine, he was told about Jonathan’s miraculous recovery. Stephen or Dr Strange went to find Jonathan who told him to seek the Ancient One in Kamar-Taj, Nepal. After one of the Ancient One’s best students, Karl Mordo, learnt the truth and betrayal of his teacher, he found Jonathan and absorbed his mystical powers, leaving him paralysed once more."
  },
  {
    "id": "hamir",
    "description": "Hamir is an elderly Master of the Mystic Arts who only has one arm. When Stephen Strange first arrived at Kamar-Taj, he mistook Hamir to be the Ancient One just based on the fact that he looked old and wise. When the Ancient One was training Stephen or Dr Strange, he complained to her that his damaged hand was hindering his process of learning magic. Upon hearing this, the Ancient One asked the one-armed Hamir to demonstrate what he could do, showing Stephen that if Hamir can do magic with one arm completely missing, nothing should stop him from performing magic."
  },
  {
    "id": "dormammu",
    "description": "Dormammu is an interdimensional being who is also the ruler of the Dark Dimensions. Dormammu convinced Kaecilius to betray his fellow Masters of the Mystic Arts and steal an ancient text that allows him to merge Earth with the Dark Dimension. Kaecilius succeeded in opening the dimensional portal to the Dark Dimension, but before Dormammu could enter Earth, he was confronted by Stephen Strange wielding the Time Stone. Stephen or Dr Strange wanted to strike a bargain with Dormammu, asking him to leave Earth alone or else he will be forever stuck in a time loop. As Dormammu killed Stephen time and time again, he kept coming back like an infinite time loop. Dormammu gave up after many attempts to end Stephen and reluctantly agreed to leave Earth alone. Before the portal closed, Dormammu absorbed Kaecilius and his Zealots into the Dimension."
  },
  {
    "id": "peterp",
    "description": "Peter Parker is a high school student at Midtown School of Science and Technology. After receiving a spider’s bite, he possessed spider-like abilities. He became the neighbourhood friendly Spider-Man. After some of his heroic acts in Queens were captured and shared on social media, Iron Man Tony Stark took notice of the kid and approached Peter for help when he needed reinforcements to find and take in Steve Rogers and Bucky. Tony crafted a new suit for Peter for the fight and allowed him to keep it after. Peter remained a well-known local superhero, but always craved to be an actual Avenger. After discovering a criminal syndicate in Queens selling illegal alien weapons, Peter tried his best to stop them but he’s often stopped by their leader, a man in a wingsuit called who calls himself “Vulture”. Discovering that ‘Vulture” was actually his crush’s father, Peter had to stop him from stealing a batch of Tony’s technology that\u0027s being relocated. Only after defeating Vulture did Peter discover the true responsibilities of a hero."
  },
  {
    "id": "mayp",
    "description": "May Parker is Spider-Man Peter Parker’s aunt. She looked after the orphaned Peter as his legal guardian. May was very protective of Peter and often asked people to walk away from trouble instead of helping. She had no idea that her nephew was actually Spider-Man. When Peter had the “Stark internship” with Iron Man Tony Stark, May appeared to be supportive of Peter, although she’s not exactly a big fan of Tony and often felt that the internship might not be what\u0027s best for Peter as it left him distracted and tired all the time."
  },
  {
    "id": "nedl",
    "description": "Edward “Ned” Leeds is the best friend of  Spider-Man Peter Parker. He was a high school student at Midtown School of Science and Technology, and also in the school’s decathlon team together with Peter and others like Michelle Jones and Liz Toomes. After discovering the secret identity of his best friend, Edward insisted on assisting Peter on his adventures, wanting to be his “guy in the chair”, the person who helped and gave the hero instructions through a earpiece. Leeds did help Peter to hack and unlock certain functions on his Spider-Man suit, and even distracted other students whenever Peter had to leave to go about his superhero business."
  },
  {
    "id": "michellej",
    "description": "Michelle Jones is a friend of both Spider-Man Peter Parker and Edward Leeds. She was a high school student at Midtown School of Science and Technology and had a strange enjoyment of mocking all her fellow students. Although Michelle kept to herself most of the time, she enjoyed company of and would often appear out of the blue around Peter and Edward. She was also in the school’s decathlon team, together with Peter, Edward and schoolmate Liz Toomes. She became the head of the team after Liz’s departure from the school."
  },
  {
    "id": "lizt",
    "description": "Liz Toomes is a friend of Spider-Man Peter Parker. She was a senior high school student at Midtown School of Science and Technology, and had a crush on Peter and knew that Peter had a crush on her as well. Liz was the head of the decathlon team with members such as Peter, Edward Leeds and Michelle Jones. It was later revealed that Liz’s father was actually Adrian Toomes or “The Vulture” who led a criminal group that sold illegal alien technology to other criminals and Peter had been trying to stop him from doing so. Liz seemed to be unaware of the activities her father was involved in. When Adrian was finally apprehended by Peter, Liz had to leave school and relocate to Oregon as her father didn’t want her to be in New York during his trials"
  },
  {
    "id": "adriant",
    "description": "Adrian Toomes is the former owner of Toomes Salvage Company and the father of Liz Toomes. After his livelihood was taken over by the government’s Department of Damage Control, Toomes chose to be a criminal and steal from the government. Recruiting his fellow salvage co-workers such as Phineas Mason, Herman Schultz and Jackson Brice, Toomes donned a flying exosuit created from stolen Chitauri technology and took on the identity of “Vulture”. After his criminal acts were discovered by Spider-Man Peter Parker, Toomes was forced to hunt down and try to take down the young hero. Toomes soon realised that the hero was actually his daughter’s schoolmate, and warned him not to interfere in his affairs anymore or he will kill him. After a battle with Peter, Toomes’ exosuit was badly damaged and he fell into a pile of burning wreckage but was saved by Peter.."
  },
  {
    "id": "eugenet",
    "description": "Eugene “Flash” Thompson was a high school student at Midtown School of Science and Technology. He was also a member of the school’s decathlon team with Peter Parker and Edward Leeds, but spent most of his time as a backup member. Eugene spent most of this time in school antagonising Peter and Edward especially after finding out from Edward that Peter knew Spider-Man personally. When Spider-Man decided to go after Adrian Toomes or Vulture right before the homecoming dance, he chanced upon Eugene in his car and took the opportunity to “borrow” the car from Eugene to give chase to Toomes."
  },
  {
    "id": "aarond",
    "description": "Aaron Davis, nicknamed “The Prowler”, is a criminal living in Queens, New York. He was seen trying to buy weapons from Jackson Brice and Herman Schutz, two members of the Adrian Toomes criminal organisation. When the weapon turned out to be alien, Davis backed out of the deal, claiming he didn’t want to “send people back in time”. Later on, Spider-Man interrogated him to find out if he knew any information about Toomes organisation. Aaron revealed the time and place of their next deal with another criminal named Mac Gargan and advised Spider-Man to get better at his job, claiming that he had a nephew in the city and didn’t want to see him hurt."
  },
  {
    "id": "jacksonb",
    "description": "Jackson Brice is a member of Adrian Toomes’ criminal organisation. His primary job was to sell the illegally modified alien weapons that Toomes stole from the government. Brice carried around a gauntlet (modified from Crossbone’s gauntlet) and called himself the Shocker. When a deal with criminal Aaron Davis went awry, and Jackson jeopardised the group by acting childish and reckless, Adrian fired Jackson from the group. When Jackson attempted to blackmail Adrian by threatening to expose the group’s activities to the authorities, he killed Jackson in retaliation. It was by accident, as he just wanted to teach him a lesson, not knowing just how lethal the weapon was."
  },
  {
    "id": "hermans",
    "description": "Herman Schultz is a member of Adrian Toomes’ criminal organisation. After Adrian killed another team member, Jackson Brice, for blackmailing him, Adrian passed Jackson’s gauntlet over to Herman and appointed him the new Shocker. Herman assisted Adrian in his deal with Mac Gargan on the Staten Island Ferry and was defeated easily by Spider-Man. Managing to escape, Herman awaited for Peter to be out of his homecoming dance and ambushed him. He was knocked out by Peter after Edward Leeds picked up Peter’s web shooters, and managed to trap Herman in a series of webs."
  },
  {
    "id": "phineasm",
    "description": "Phineas Mason, also known as the Tinkerer, is a member of Adrian Toomes’ criminal organisation and is arguably the most important member of the group. Phineas’ job was to modify the goods stolen by Adrian into advanced weaponry. Due to the interference of Spider-Man, Phineas’ weapons were at risk of getting noticed, even by Iron Man Tony Stark. Adrian was on the verge of shutting down the operations altogether before Phineas convinced him to do a final heist on Tony’s tech that\u0027s being relocated."
  },
  {
    "id": "macg",
    "description": "Mac Gargan is a professional criminal and one of Adrian Toomes’ potential buyers for his modified alien weapons. The deal went smoothly on the Staten Island Ferry before getting interrupted by Spider-Man, which ended up with Mac and his crew getting arrested by the FBI. Incarcerated, Mac sought out the recently jailed Adrian for information about Spider-Man, but he lied that he had no idea who the web-slinger was."
  },
  {
    "id": "annem",
    "description": "Anne Marie Hoag is the new director of the Department of Damage Control, a department in collaboration with Iron Man Tony Stark that handles all the clean-up operations in the wake of any Avengers activities. The introduction of this department put private salvage companies such as Toomes Salvage Company - belonging to Adrian Toomes - out of business."
  },
  {
    "id": "principalm",
    "description": "Principal Morita is in charge of Midtown School for Science and Technology, the school that Peter Parker and many others are currently in. Morita was the grandchild of the Jim Morita, a member of the Howling Commandos who fought against Hydra in World War II, together with Captain America Steve Rogers."
  },
  {
    "id": "erikk",
    "description": "Erik Killmonger, born N’Jadaka, is a Wakandan prince, son of N’Jobu. As a child, Erik’s father was killed by the king, T’Chaka, for betraying the kingdom of Wakanda by selling them out to black market smuggler Ulysses Klaue. Erik was left in Oakland. Growing up, Erik became an American black-ops soldier and earned the nickname “Killmonger” for his ruthlessness. Manipulating and then killing Ulysses, Erik made his way back to Wakanda where he challenged T’Challa for the rights to the throne. After beating T’Challa in combat and seemingly killing him, Erik donned his new Black Panther suit and assumed the role as king. Frustrated that Wakanda kept its resources to itself and refused help to people of the same race out there who\u0027s suffering, Erik got weapons of destruction to these people, in hope that they overthrow their government. T’Challa returned to fight Erik and defeated him."
  },
  {
    "id": "nakia",
    "description": "Nakia is a Wakandan spy, and ex-lover of the king, T’Challa. She is also the warrior representing the River Tribe of Wakanda. Nakia was on an undercover human-trafficking mission in Nigeria before getting rescued by T’Challa and Okoye after the death of T’Chaka. T’Challa wanted Nakia to be present for his coronation to become the new king. When Erik Killmonger defeated and seemingly killed T’Challa, and assumed the role of king, Nakia was one of the only people who defied the new king and escaped Wakanda with Shuri and Ramonda. After discovering that T’Challa was still alive, she healed him with Ramonda and aided T’Challa in the final battle against Killmonger and his forces."
  },
  {
    "id": "okoye",
    "description": "Okoye is the general of the Dora Milaje, a group of highly trained Wakandan women and the head of security in Wakanda’s armed forces. She also served as the personal bodyguard of the king, T’Challa, and barely left his side. Okoye joined T’Challa and Nakia in their mission to South Korea and pursued black market smuggler Ulysses Klaue. When Erik Killmonger defeated and seemingly killed T’Challa, and assumed the role of king, Okoye had no choice but to serve the new king. When T’Challa finally returned to claim his throne, Okoye and her Dora Milaje turned on Killmonger and tried to take him down."
  },
  {
    "id": "shuri",
    "description": "Shuri is the princess of Wakanda, sister to T’Challa and daughter to the king, T’Chaka, and the queen, Ramonda. She is also the leader of the Wakandan Design Group, inventing many of the Vibranium technology used by all of Wakanda. She designed his brother’s new Black Panther suit. After T’Chaka’s death,  Bucky Barnes (Winter Soldier) was left in Wakanda to heal and Shuri was placed in charge to rid him of Hydra’s brainwashing. Shuri assisted T’Challa and his group when they were in South Korea pursuing black market smuggler Ulysses Klaue and also in the final battle against Erik Killmonger and his forces."
  },
  {
    "id": "ramonda",
    "description": "Ramonda is the queen of Wakanda, the mother of T’Challa and Shuri, and wife of the king, T’Chaka. After the death of her husband in the UN bombing incident, Ramonda was saddened but welcomed T’Challa back to Wakanda in time for his coronation to become the next king.When Erik Killmonger defeated and seemingly killed T’Challa, and assumed the role of king, Ramonda escaped Wakanda with her daughter and Nakia, and sought help from the Jabari tribe. When they found out that T’Challa was still alive, Ramonda and Nakia healed him."
  },
  {
    "id": "wkabi",
    "description": "W’Kabi is T’Challa’s best friend and also the warrior for the Border Tribe of Wakanda. It is also implied that he’s the lover of Okoye, general of the Dora Milaje. W’Kabi’s parents were killed by black market smuggler Ulysses Klaue when he was attempting to escape Wakanda years ago, so when W’Kabi found out that T’Challa failed in the pursuit of Ulysses in South Korea, he turned his back on his best friend. W’Kabi allowed Erik Killmonger into Wakanda, supporting him in taking the throne of T’Challa. In the final battle between T’Challa and Erik, W’Kabi led the Wakandan forces and War Rhinos against his former best friend and only surrendered in the end, after his War Rhino refused to attack Okoye."
  },
  {
    "id": "mbaku",
    "description": "M’Baku is the warrior and leader of the Jabari Tribe, a group of Wakandan who removed themselves from the other four tribes of Wakanda. When T’Chaka died, T’Challa was set to be crowned King but the tribes were allowed to challenge T’Challa for a chance to the throne. When no one else stepped up for the challenge, M’Baku challenged him. M’Baku was defeated in combat and retreated to the mountains. Later, When Erik Killmonger defeated and seemingly killed T’Challa, and assumed the role of king, T’Challa’s body was found by a Jabari fisherman and brought to M’Baku. He preserved T’Challa’s body in ice and led Nakia, Ramonda and Shuri to him for healing. Although refusing to help at first, M’Baku eventually led his Jabari forces in the final battle against Erik’s forces in Wakanda."
  },
  {
    "id": "zuri",
    "description": "Zuri is a Wakandan Shaman and the advisor to the King. Once a Wakandan spy for the king, T’Chaka, to watch the prince, N’Jobu, Zuri notified T’Chaka about N’Jobu’s treason against Wakanda. When N’Jobu found about Zuri’s betrayal, he tried to kill Zuri, resulting in his own death in the hands of his brother, T’Chaka. When N’Jobu’s son, Erik Killmonger challenged T’Challa for the throne, Zuri confessed that he was the reason Erik’s father was killed. Erik killed Zuri by stabbing him with his blade."
  },
  {
    "id": "njobu",
    "description": "N’Jobu is the prince of Wakanda, brother to the king, T’Chaka, and father of Erik Killmonger. Frustrated that Wakanda kept its resources to itself and refused help to people of the same race out there who\u0027s suffering, N’Jobu helped a black market smuggler, Ulysses Klaue, steal Vibranium material from Wakanda. Notified about his brother’s treachery, T’Chaka confronted N’Jobu at his apartment in Oakland, but before he could take N’Jobu back to Wakanda for trial, N’Jobu tried to kill Zuri, a spy planted by T’Chaka to watch N’Jobu. T’Chaka retaliated and killed N’Jobu."
  },
  {
    "id": "miningt",
    "description": "The Mining Tribe Elder is a member of the Wakandan Tribal Council, and the leader of the Mining Tribe. Being one of the five original Wakandan Tribe, each elder is allowed to send a warrior to represent their tribe to challenge the would-be king during the coronation. The Mining Tribe Elder and her tribe chose not to challenge T’Challa."
  },
  {
    "id": "bordert",
    "description": "The Border Tribe Elder is a member of the Wakandan Tribal Council, and the leader of the Border Tribe. Being one of the five original Wakandan Tribe, each elder is allowed to send a warrior to represent their tribe to challenge the would-be king during the coronation. The Border Tribe’s warrior is T’Challa’s best friend, W’Kabi, but the Border Tribe Elder and his tribe chose not to challenge T’Challa."
  },
  {
    "id": "rivert",
    "description": "The River Tribe Elder is a member of the Wakandan Tribal Council, and the leader of the River Tribe. Being one of the five original Wakandan Tribe, each elder is allowed to send a warrior to represent their tribe to challenge the would-be king during the coronation. The River Tribe’s warrior is T’Challa’s ex-lover, Nakia, but the River Tribe Elder and his tribe chose not to challenge T’Challa."
  },
  {
    "id": "merchantt",
    "description": "The Merchant Tribe Elder is a member of the Wakandan Tribal Council, and the leader of the Merchant Tribe. Being one of the five original Wakandan Tribe, each elder is allowed to send a warrior to represent their tribe to challenge the would-be King during the coronation. The Merchant Tribe Elder and her tribe chose not to challenge T’Challa."
  },
  {
    "id": "midnightp",
    "description": "Proxima Midnight is one of the children of Thanos. Proxima and three other children, Corvus Glaive, The Ebony Maw and Cull Obsidian has been tasked by Thanos to retrieve the Infinity Stones from the Avengers."
  },
  {
    "id": "corviusg",
    "description": "Corvus Glaive is one of the children of Thanos. Corvus and three other children, Proxima Midnight, Ebony Maw and Cull Obsidian had been tasked by Thanos to retrieve the Infinity Stones from the Avengers."
  },
  {
    "id": "ebonym",
    "description": "Ebony Maw is one of the children of Thanos. Maw and three other children, Corvus Glaive, Proxima Midnight and Cull Obsidian has been tasked by Thanos to retrieve the Infinity Stones from the Avengers."
  },
  {
    "id": "obsidianc",
    "description": "Cull Obsidian is one of the children of Thanos. Obsidian and three other children, Corvus Glaive, Ebony Maw and Proxima Midnight has been tasked by Thanos to retrieve the Infinity Stones from the Avengers."
  },
  {
    "id": "outrider",
    "description": "Outriders are a species of four-armed alien that form Thanos’s invasion army.  Together with Thanos’s four children, Proxima Midnight, Corvus Glaive, Ebony Maw and Cull Obsidian, the Outriders have been tasked by Thanos to retrieve the Infinity Stones from the Avengers."
  },
  {
    "id": "bettyb",
    "description": "Betty Brant is a friend of Spider-Man Peter Parker and best friend with Liz Toomes. She was a high school student at Midtown School of Science and Technology. Betty was also the news anchor on the school’s news programme."
  },
  {
    "id": "stanlee",
    "description": "Stan Lee is one of the creators\/writers of the Marvel Universe. Stan has appeared in every single Marvel Cinematic Universe movie so far in cameo roles. It was revealed in Guardians Of The Galaxy Vol. 2 that the characters he played in the cameo roles are actually the same person, who served as an informant for a cosmic being called the Watcher."
  },
  {
    "id": "im1",
    "description": "Iron Man tells the story of Tony Stark, a billionaire industrialist and genius inventor who is kidnapped and forced to build a devastating weapon. Instead, using his intelligence and ingenuity, Tony builds a high-tech suit of armour and escapes captivity. When he uncovers a nefarious plot with global implications, he dons his powerful armor and vows to protect the world as Iron Man."
  },
  {
    "id": "hk1",
    "description": "The Incredible Hulk tells the story of Bruce Banner, brilliant biochemist who, after a freak accident, is now living in the shadows, cut off from the life he knew and the woman he loves. Banner struggles to avoid capture and to keep the unbridled force of rage within him at bay. One scientist must make an agonising choice: Accept a peaceful life as Bruce or find heroism in the creature he holds inside - The Hulk."
  },
  {
    "id": "im2",
    "description": "Iron Man 2 follows Tony Stark, billionaire inventor and superhero who must now face a new threat with the grudge against the Stark family. As the Iron Man discovers that the arc reactor that is keeping him alive is also poisoning him, it’s a race against time to find a solution before it’s too lat"
  },
  {
    "id": "th1",
    "description": "Thor tells the story of a powerful but arrogant warrior whose reckless actions reignite an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth."
  },
  {
    "id": "ca1",
    "description": "Captain America: The First Avenger focuses on the early days of the Marvel Universe when Steve Rogers volunteers to participate in an experimental programme that turns him into the Super Soldier known as Captain America, in order to stop Hydra, a secret organisation that’s hell-bent on taking control of the world."
  },
  {
    "id": "av1",
    "description": "Marvel\u0027s The Avengers brings together the team-up of a lifetime, featuring iconic Marvel superheroes Iron Man, the Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When an unexpected enemy emerges that threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D, finds himself in need of a team to pull the world back from the brink of disaster."
  },
  {
    "id": "im3",
    "description": "Iron Man 3 pits the brash but brilliant industrialist Tony Stark against an enemy whose reach knows no bounds. When the Iron Man finds his personal world destroyed at his enemy\u0027s hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle. With his back against the wall, Tony is left to survive by his own devices, relying on his ingenuity and instincts to protect those closest to him. As he fights his way back, Tony discovers the answer to the question that has secretly haunted him: Does the man make the suit or does the suit make the man."
  },
  {
    "id": "th2",
    "description": "Thor: The Dark World continues the big screen adventures of Thor, the Mighty Avenger, as he battles to save Earth and all the Nine Realms from a shadowy enemy that predates the universe itself. In the aftermath of Marvel\u0027s \u0022Thor\u0022 and \u0022Marvel\u0027s The Avengers\u0022 Thor fights to restore order across the cosmos. But an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save the world."
  },
  {
    "id": "ca2",
    "description": "Captain America: The Winter Soldier finds Steve Rogers living quietly in Washington, DC and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy - the Winter Soldier."
  },
  {
    "id": "gotg1",
    "description": "Guardians of the Galaxy expands the Marvel Cinematic Universe into the cosmos, where brash adventurer Peter Quill finds himself the object of an unrelenting bounty hunt after stealing a mysterious orb coveted by Ronan, a powerful villain with ambitions that threaten the entire universe. To evade the ever-persistent Ronan, Quill is forced into an uneasy truce with a quartet of disparate misfits - Rocket, a gun-toting raccoon; Groot, a tree-like humanoid; the deadly and enigmatic Gamora; and the revenge-driven Drax the Destroyer. But when Quill discovers the true power of the orb and the menace it poses to the cosmos, he must do his best to rally his ragtag rivals for a last, desperate stand - with the galaxy\u0027s fate in the balance."
  },
  {
    "id": "av2",
    "description": "Avengers: Age of Ultron is the epic follow-up to the biggest superhero movie of all time. When Iron Man Tony Stark tries to jumpstart a dormant peacekeeping programme, things go awry and Earth\u0027s mightiest heroes, including Iron Man, Captain America, Thor, The Incredible Hulk, Black Widow and Hawkeye, are put to the ultimate test as the fate of the planet hangs in the balance. As villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon, uneasy alliances and unexpected action pave the way for an epic and unique global adventure."
  },
  {
    "id": "am1",
    "description": "Ant-Man bookends the Marvel phase two films. Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Hank and Scott must plan and pull off a heist that will save the world."
  },
  {
    "id": "ca3",
    "description": "Captain America: Civil War finds Steve Rogers leading the newly formed team of Avengers in their continued efforts to safeguard humanity. But after another incident involving the Avengers results in collateral damage, political pressure mounts to install a system of accountability, headed by a governing body to oversee and direct the team. The new status quo fractures the Avengers, resulting in two camps - one led by Captain America Steve Rogers and his desire for the Avengers to remain free to defend humanity without government interference, and the other following Iron Man Tony Stark’s surprising decision to support government oversight and accountability."
  },
  {
    "id": "ds1",
    "description": "Doctor Strange tells the story of world-famous neurosurgeon Dr Stephen Strange whose life changes forever after a horrific car accident robs him of the use of his hands. When traditional medicine fails him, he is forced to look for healing, and hope, in an unlikely place - a mysterious enclave known as Kamar-Taj. He quickly learns that this is not just a centre for healing but also the front line of a battle against unseen dark forces bent on destroying our reality. Before long Strange - armed with newly acquired magical powers - is forced to choose whether to return to his life of fortune and status, or leave it all behind to defend the world as the most powerful sorcerer in existence."
  },
  {
    "id": "gotg2",
    "description": "Guardians Of The Galaxy Vol. 2 continues the team’s adventures as they traverse the outer reaches of the cosmos. The Guardians must fight to keep their newfound family together as they unravel the mystery of Peter Quill’s true parentage. Old foes become new allies and fan-favourite characters from the classic comics will come to our heroes’ aid as the Marvel Cinematic Universe continues to expand."
  },
  {
    "id": "sm1",
    "description": "Spider-Man: Homecoming follows a young Peter Parker\/Spider-Man, who made his sensational debut in Captain America: Civil War, begins to navigate his newfound identity as the web-slinging superhero. Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor, Tony Stark. Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighbourhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened."
  },
  {
    "id": "th3",
    "description": "Thor: Ragnarok finds our hero imprisoned on the other side of the universe without his mighty hammer. Thor is in a race against time to get back to Asgard to stop Ragnarok - the destruction of his homeworld and the end of Asgardian civilisation - at the hands of an all-powerful new threat, the ruthless Hela. But first, he must survive a deadly gladiatorial contest that pits him against his former ally and fellow Avenger - the Incredible Hulk."
  },
  {
    "id": "bp1",
    "description": "Black Panther follows T’Challa who - after the death of his father, the king of Wakanda - returns home to the isolated, technologically advanced African nation to succeed to the throne and take his rightful place as king. But when a powerful old enemy reappears, T’Challa’s mettle as king - and Black Panther - is tested when he is drawn into a formidable conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people and their way of life."
  }]
  }